[
  {
    "name": "Aatrox",
    "role": "TOP",
    "class": "Lutador / Duelista",
    "description": "Aatrox é um duelista de alto impacto que domina trocas longas e all-ins. Seu kit oferece grande sustain em lutas prolongadas e controle de grupo consistente, o que o torna perigoso em combates 1v1 e em escaramuças na rota superior.\n\nPara jogar bem de Aatrox, priorize converter trades em janelas onde seu cura e dano sustentado façam a diferença. Evite entrar em lutas onde você possa ser interrompido por muito CC ou burst que exploda você antes de sua cura agir.",
    "lore": "Aatrox é um Darkin, uma antiga arma viva que busca a destruição para saciar sua fúria. Após séculos aprisionado, agora vaga em busca de guerra.",
    "forte_contra": [
      "Nasus",
      "Sion",
      "Sett"
    ],
    "fraco_contra": [
      "Quinn",
      "Teemo",
      "Fiora"
    ],
    "sinergia_com": [
      "Sejuani",
      "Leona",
      "Orianna"
    ]
  },
  {
    "name": "Ahri",
    "role": "MID",
    "class": "Mago / Assassina",
    "description": "Ahri é uma maga móvel focada em picks e roams. Seu dano em burst combinado com mobilidade lhe permite criar eliminações e voltar são ao território seguro. Na rota, ela pressiona com seu orbe e busca encantar alvos para combos decisivos.\n\nEm partidas, Ahri funciona como um criador de vantagem individual: capitalize em erros de posicionamento dos adversários e transforme pequenas aberturas em vantagem de mapa através de roaming.",
    "lore": "Ahri é uma vastaya de nove caudas que colhe essência vital para alimentar seus poderes, sempre dividida entre natureza predatória e busca por identidade.",
    "forte_contra": [
      "Lux",
      "Syndra",
      "Veigar"
    ],
    "fraco_contra": [
      "Zed",
      "Kassadin",
      "LeBlanc"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Sejuani",
      "Thresh"
    ]
  },
  {
    "name": "Akali",
    "role": "MID/TOP",
    "class": "Assassina",
    "description": "Akali é uma assassina extremamente móvel que depende de furtividade e execuções rápidas. Seu kit recompensa o processamento correto de janelas de dano e a utilização da névoa para reposicionamento.\n\nContra campeões com muito controle de grupo ou visão verdadeira, Akali perde grande parte de sua eficácia. Como Akali, procure isolar alvos e punir erros de posicionamento.",
    "lore": "Akali foi discípula da ordem Kinkou, mas escolheu atuar sozinha para manter o equilíbrio à sua maneira — uma lâmina que age nas sombras por Ionian peace.",
    "forte_contra": [
      "Ryze",
      "Orianna",
      "Lux"
    ],
    "fraco_contra": [
      "Lissandra",
      "Galio",
      "Rumble"
    ],
    "sinergia_com": [
      "Shen",
      "Lee Sin",
      "Rakan"
    ]
  },
  {
    "name": "Akshan",
    "role": "MID",
    "class": "Atirador / Assassino",
    "description": "Akshan é um campeão híbrido que mistura dano à distância com mobilidade excepcional. Sua mecânica de reviver aliados abatidos (quando certas condições são atendidas) e seu hook-swing proporcionam jogadas únicas de perseguição.\n\nAkshan brilha em lutas onde consegue movimentar-se e atacar com segurança; ele precisa de espaço para atirar e reposicionar sem ser pego.",
    "lore": "Akshan é um sentinela que busca justiça pelos inimigos de Shurima, combinando estilo e astúcia com armas lendárias e um senso curioso de humor.",
    "forte_contra": [
      "Twisted Fate",
      "Ziggs",
      "Veigar"
    ],
    "fraco_contra": [
      "Zed",
      "Yasuo",
      "LeBlanc"
    ],
    "sinergia_com": [
      "Thresh",
      "Rakan",
      "Jarvan IV"
    ]
  },
  {
    "name": "Alistar",
    "role": "SUPORTE",
    "class": "Tanque / Suporte",
    "description": "Alistar é um suporte de engage e peel com grande capacidade de isolar alvos e proteger o carry. Seu combo de pulverizar + cabeçada é uma ameaça constante que obriga o inimigo a jogar com cautela.\n\nSaber quando usar a ultimate defensivamente ou ofensivamente é crucial; Alistar pode tanto iniciar lutas quanto resetar objetivos ao proteger aliados.",
    "lore": "Alistar é um minotauro que luta por justiça e pela liberdade de seu povo, usando sua força para proteger os vulneráveis.",
    "forte_contra": [
      "Blitzcrank",
      "Nautilus",
      "Thresh"
    ],
    "fraco_contra": [
      "Morgana",
      "Janna",
      "Lulu"
    ],
    "sinergia_com": [
      "Miss Fortune",
      "Kai'Sa",
      "Tristana"
    ]
  },
  {
    "name": "Ambessa",
    "role": "TOP, FIGHTER, TANK",
    "class": "Lutador, Tanque",
    "lore": "Ambessa Medarda é uma general noxiana temida, mãe de Mel Medarda. Sua disciplina implacável e brutalidade no campo de batalha a tornaram um ícone de poder militar.",
    "description": "Ambessa é resistente e dominante em rotas solo, com forte presença em lutas de equipe e iniciação direta.",
    "forte_contra": [
      "Camille",
      "Irelia",
      "Renekton"
    ],
    "fraco_contra": [
      "Fiora",
      "Vayne",
      "Quinn"
    ],
    "sinergia_com": [
      "Sejuani",
      "Darius",
      "Jarvan IV"
    ]
  },
  {
    "name": "Amumu",
    "role": "JUNGLE",
    "class": "Tanque / Control Mage",
    "description": "Amumu é um jungler de iniciação com uma ultimate em área devastadora. Ele oferece engages seguros e consistente pressão em teamfights, sendo especialmente forte contra composições agrupadas.\n\nO sucesso com Amumu depende de visão e coordenação: um bom engage em objetivo pode decidir partidas inteiras.",
    "lore": "Amumu é uma múmia solitária cuja maldição causa tristeza profunda; sua história é envolta em mistério e compaixão melancólica.",
    "forte_contra": [
      "Times agrupados",
      "Comps de pouco disengage"
    ],
    "fraco_contra": [
      "Times com alta mobilidade",
      "Composições espalhadas"
    ],
    "sinergia_com": [
      "Orianna",
      "Miss Fortune",
      "Leona"
    ]
  },
  {
    "name": "Anivia",
    "role": "MID",
    "class": "Mago / Controlador",
    "description": "Anivia é uma campeã de controle de zona e poke, com grande capacidade de transformar áreas do mapa em território hostil. Seu kit permite controlar o ritmo das lutas e negar movimentos inimigos com paredes e lentidões.\n\nAnivia exige posicionamento preciso e timing de habilidades — utilizar bem sua parede e ult pode anular uma investida inteira.",
    "lore": "Anivia é o espírito protetor do Freljord, representando renascimento e resiliência através de sua forma de ave de gelo.",
    "forte_contra": [
      "Campeões sem mobilidade",
      "Comps corpo-a-corpo"
    ],
    "fraco_contra": [
      "Assassinos ágeis",
      "Campeões que quebram zona facilmente"
    ],
    "sinergia_com": [
      "Sejuani",
      "Jarvan IV",
      "Nautilus"
    ]
  },
  {
    "name": "Annie",
    "role": "MID",
    "class": "Mago / Burst",
    "description": "Annie é uma maga com alto burst e controle com seu stun em área (com Tibbers). Ela se destaca no level 6, onde Tibbers pode mudar escaramuças e criar picks instantâneos.\n\nJogar de Annie significa capitalizar em picos de nível e controlar flancos — é uma pick simples mas extremamente eficiente em cliques certeiros.",
    "lore": "Annie é uma criança com magia flamejante e seu companheiro de pelúcia, Tibbers; juntas, elas trazem fogo e caos onde passam.",
    "forte_contra": [
      "Mages de poke",
      "Comps fracas em engage"
    ],
    "fraco_contra": [
      "Assassinos móveis",
      "Champions com gapclose"
    ],
    "sinergia_com": [
      "Amumu",
      "Jarvan IV",
      "Leona"
    ]
  },
  {
    "name": "Aphelios",
    "role": "BOT",
    "class": "Atirador / Marksman",
    "description": "Aphelios é um atirador complexo com armas alternadas que mudam radicalmente seu padrão de jogo. Seu kit exige entendimento profundo das armas e das rotas de dano para tirar máximo proveito das sinergias entre elas.\n\nAphelios é frágil, mas extremamente punidor em mãos certas — posicionamento e conhecimento do toolkit são essenciais.",
    "lore": "Aphelios é um noxiano silencioso que empunha armas lunares, cada uma com proezas e histórias próprias, servindo ao seu povo com devoção silenciosa.",
    "forte_contra": [
      "Comps sem engage",
      "Atiradores de alcance curto"
    ],
    "fraco_contra": [
      "Assassinos com gapclose",
      "Hard engage supports"
    ],
    "sinergia_com": [
      "Nami",
      "Thresh",
      "Lulu"
    ]
  },
  {
    "name": "Ashe",
    "role": "BOT",
    "class": "Atiradora / Marksman",
    "description": "Ashe é uma atiradora utilitária com forte controle de mapa por meio de seu ultimate global e kit de slows. Ela fornece iniciadores a longa distância e tem bom controle de zona em teamfights.\n\nAshe depende muito de posicionamento e peel; com suporte certo, ela pode ditar as lutas por causa de sua ultimate e do kite constante.",
    "lore": "Ashe é uma líder do norte, uma arqueira que busca unir seu povo pelo poder e visão tática que suas flechas proporcionam.",
    "forte_contra": [
      "Comps de pouca mobilidade",
      "Atiradores com pouca defesa"
    ],
    "fraco_contra": [
      "Diving assassins",
      "Champions que rompem linhas"
    ],
    "sinergia_com": [
      "Leona",
      "Braum",
      "Nautilus"
    ]
  },
  {
    "name": "Aurelion Sol",
    "role": "MID",
    "class": "Mago / Battlemage",
    "description": "Aurelion Sol é um mago único que controla espaço com estrelas orbitais; sua força está no controle de áreas e no roaming de alto alcance. Ele vira uma grande ameaça quando consegue manipular o posicionamento inimigo para maximizar o dano de suas estrelas.\n\nRequer bom senso de posicionamento e timing para não ser pego enquanto lança suas estrelas e usa seu voo para rotas laterais.",
    "lore": "Aurelion Sol é uma entidade estelar que cria e manipula céus; enganado e subjulgado por seres menores, busca recuperar sua liberdade e esplendor.",
    "forte_contra": [
      "Mages amontoados",
      "Times que dependem de se agrupar"
    ],
    "fraco_contra": [
      "Assassinos com burst",
      "Champions que evitam área"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Sejuani",
      "Nautilus"
    ]
  },
  {
    "name": "Aurora",
    "role": "MID, MAGE",
    "class": "Mago, Controlador",
    "lore": "Aurora é uma feiticeira oriunda do Freljord, que se conecta com espíritos antigos para manipular a energia ao seu redor.",
    "description": "Aurora é focada em controle de zona e utilidade mágica, com bastante poder em fights longas.",
    "forte_contra": [
      "Lux",
      "Orianna",
      "Seraphine"
    ],
    "fraco_contra": [
      "Zed",
      "LeBlanc",
      "Fizz"
    ],
    "sinergia_com": [
      "Sejuani",
      "Lissandra",
      "Ashe"
    ]
  },
  {
    "name": "Azir",
    "role": "MID",
    "class": "Mago / Specialist",
    "description": "Azir é um mago de zona com alto potencial de poke e controle via soldados. Sua curva de aprendizado é alta: mestre em controle de espaço e com bom DPS em lutas prolongadas.\n\nAzir prospera em partidas longas onde escala; usar soldados para pressionar rotas e posicionar bem em teamfights é fundamental.",
    "lore": "Azir é um imperador reencarnado de Shurima, buscando restaurar o antigo império através de suas habilidades e comando sobre o deserto.",
    "forte_contra": [
      "Mages sem mobilidade",
      "Comps de melees fracas"
    ],
    "fraco_contra": [
      "Assassinos",
      "Gaps closers que o alcançam"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Sejuani",
      "Lulu"
    ]
  },
  {
    "name": "Bard",
    "role": "SUPORTE",
    "class": "Suporte / Roamer",
    "description": "Bard é um suporte único focado em roams e controle de mapa usando portais e chimes. Seu estilo recompensa a visão global e jogadas criativas para mudar o ritmo da partida.\n\nBard exige coordenação: suas habilidades podem selar objetivos e picks que normalmente seriam impossíveis para supports lineares.",
    "lore": "Bard é um viajante cósmico que guia o equilíbrio entre mundos através de melodias e enigmas.",
    "forte_contra": [
      "Supports passivos",
      "Times sem roaming"
    ],
    "fraco_contra": [
      "Engages pesados",
      "Suportes com grande peel"
    ],
    "sinergia_com": [
      "Ashe",
      "Aphelios",
      "Caitlyn"
    ]
  },
  {
    "name": "Bel'Veth",
    "role": "JUNGLE",
    "class": "Fighter / Skirmisher",
    "description": "Bel'Veth é uma caçadora do Vazio que escala brutalmente com abates e objetivos. Ela domina em limpeza rápida e em snowball para esmagar alvos enquanto cresce em tamanho e poder.\n\nEm comps que não a controlam cedo, Bel'Veth pode virar o jogo sozinha; controle de visão e cortes de rota são essenciais contra ela.",
    "lore": "Bel'Veth é uma imperatriz do Vazio, devorando mundos e adaptando sua forma conforme consome suas presas.",
    "forte_contra": [
      "Junglers lentos",
      "Times sem controle"
    ],
    "fraco_contra": [
      "Alto CC",
      "Comps que a isolam"
    ],
    "sinergia_com": [
      "Orianna",
      "Leona",
      "Miss Fortune"
    ]
  },
  {
    "name": "Blitzcrank",
    "role": "SUPORTE",
    "class": "Tanque / Suporte",
    "description": "Blitzcrank é um suporte de pick cujo hook pode mudar o ritmo da rota e da partida inteira. Um puxão bem-sucedido concede vantagem numérica imediata e abre espaço para abates.\n\nBlitzcrank é perigoso em rotas com pouca visão; como inimigo, evite ficar desligado ou sobrepassado perto de paredes onde o gancho é provável.",
    "lore": "Blitzcrank foi construído para servir Zaun, e sua curiosidade mecânica o leva a intervir onde o perigo surge.",
    "forte_contra": [
      "Carries sem mobilidade",
      "Supportes passivos"
    ],
    "fraco_contra": [
      "Pilhas de visão",
      "Champions que evitam hooks"
    ],
    "sinergia_com": [
      "Caitlyn",
      "Ashe",
      "Jinx"
    ]
  },
  {
    "name": "Brand",
    "role": "MID",
    "class": "Mago / Burst",
    "description": "Brand é um mago de dano em área com grande sinergia em comps que prendem inimigos. Seu dano em chamas causa explosões em multi-hits e pune times que se acumulam.\n\nBrand é mortal em lutas agrupadas e troca bem com mages que não o punem com mobilidade.",
    "lore": "Brand é uma entidade de fogo viva, consumida por vingança e sede de destruição.",
    "forte_contra": [
      "Times agrupados",
      "Low sustain comps"
    ],
    "fraco_contra": [
      "High mobility champions",
      "Champions with quick disengage"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Sejuani",
      "Lulu"
    ]
  },
  {
    "name": "Braum",
    "role": "SUPORTE",
    "class": "Tanque / Suporte",
    "description": "Braum é um suporte defensivo com grande capacidade de peel graças ao seu escudo e stun em cadeia. Ele protege o carry e cria janelas seguras para revidar.\n\nBraum é forte contra comps que dependem de poke e fraqueza contra equipes que rompem a linha defensiva com engage.",
    "lore": "Braum é o coração caloroso do Freljord, conhecido por seu escudo, força e histórias sobre feitos lendários.",
    "forte_contra": [
      "Poke comps",
      "Squishy ADCs"
    ],
    "fraco_contra": [
      "Poke pesado",
      "Kiting comps"
    ],
    "sinergia_com": [
      "Ashe",
      "Caitlyn",
      "Jinx"
    ]
  },
  {
    "name": "Briar",
    "role": "JUNGLE, FIGHTER, ASSASSIN",
    "class": "Lutador, Assassino",
    "lore": "Briar é uma criada do clã Noxiano, movida por uma fome insaciável e uma sede de sangue que a torna imprevisível.",
    "description": "Briar se destaca em emboscadas agressivas e perseguição de alvos frágeis, mas pode ser controlada facilmente com CC.",
    "orte_contra": [
      "Kindred",
      "Master Yi",
      "Viego"
    ],
    "fraco_contra": [
      "Sejuani",
      "Udyr",
      "Warwick"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Thresh"
    ],
    "forte_contra": [
      "Lux",
      "Ezreal",
      "Orianna"
    ]
  },
  {
    "name": "Caitlyn",
    "role": "BOT",
    "class": "Atiradora / Marksman",
    "description": "Caitlyn é uma atiradora de longo alcance que domina a lane com armadilhas e poke. Ela prioriza controle de zona e pressionar o adversário para negar farm.\n\nEm teamfights, Caitlyn funciona bem em composições que capitalizam em sua zona e pick potencial.",
    "lore": "Caitlyn é a xerife de Piltover, conhecida por sua precisão, inteligência e dedicação à lei.",
    "forte_contra": [
      "Curto alcance",
      "Lutas sem engage"
    ],
    "fraco_contra": [
      "Assassinos dive",
      "Alta mobilidade"
    ],
    "sinergia_com": [
      "Morgana",
      "Braum",
      "Leona"
    ]
  },
  {
    "name": "Camille",
    "role": "TOP",
    "class": "Duelista / Fighter",
    "description": "Camille é um duelista com ferramentas de isolamento e mobilidade vertical (saltos em paredes). Ela domina 1v1 e split-push, sendo excelente em isolar alvos vulneráveis.\n\nCamille necessita de micro e conhecimento de quando puxar trades; em teamfights, seu papel é encontrar e isolar o carry inimigo.",
    "lore": "Camille é uma agente de Piltover aprimorada por hextech, dedicada a proteger a ordem e seus interesses com precisão fria.",
    "forte_contra": [
      "Immobile toplaners",
      "Targets isoláveis"
    ],
    "fraco_contra": [
      "Heavy CC teams",
      "Sustained kite"
    ],
    "sinergia_com": [
      "Leona",
      "Jarvan IV",
      "Sejuani"
    ]
  },
  {
    "name": "Cassiopeia",
    "role": "MID",
    "class": "Mago / Controller",
    "description": "Cassiopeia é uma maga de DPS contínuo com controle de zona baseado em veneno. Ela tem grande presença em lutas estendidas e pode punir erros de posicionamento com sua serralharia de dano.\n\nSeu timing e posicionamento são essenciais; acertar a cadeia de habilidades aumenta seu poder de maneira exponencial.",
    "lore": "Cassiopeia foi transformada por magia proibida, tornando-se uma figura serpentina que espalha veneno e maldição.",
    "forte_contra": [
      "Mages sem mobilidade",
      "Comps que dependem de correr"
    ],
    "fraco_contra": [
      "Assassinos",
      "Long-range poke"
    ],
    "sinergia_com": [
      "Amumu",
      "Nautilus",
      "Leona"
    ]
  },
  {
    "name": "Cho'Gath",
    "role": "TOP",
    "class": "Tanque / Mage",
    "description": "Cho'Gath é um colosso do Vazio que escala com stacks, tornando-se progressivamente maior e mais resistente. Ele tem potencial de controle em área e dano verdadeiro por meio de seu ultimate quando acumulado.\n\nCho'Gath funciona bem em rotas onde consegue farm e stacks, e em comps que aproveitam um front-line sólido.",
    "lore": "Cho'Gath é uma entidade do Vazio que devora carne e mundos, crescendo com cada presa engolida.",
    "forte_contra": [
      "Squishy carries",
      "Comps sem sustain"
    ],
    "fraco_contra": [
      "Kiting teams",
      "High mobility"
    ],
    "sinergia_com": [
      "Orianna",
      "Amumu",
      "Sion"
    ]
  },
  {
    "name": "Corki",
    "role": "MID/BOT",
    "class": "Marksman / Mage",
    "description": "Corki é um atirador/mago híbrido que causa dano mágico e físico, dependendo de itens. Seu pico em mid/late game é forte com itens de transformação (Hextech) e seu burst em área pode fechar picks.\n\nCorki demanda posicionamento seguro e bom uso de sua mobilidade para maximizar dano sem ser pego.",
    "lore": "Corki é um piloto piltoveriano audaz, sempre pronto para aventuras aéreas e combates com foguetes.",
    "forte_contra": [
      "Mages sem mobilidade",
      "Comps lentas"
    ],
    "fraco_contra": [
      "Assassinos dive",
      "High CC"
    ],
    "sinergia_com": [
      "Nautilus",
      "Sejuani",
      "Leona"
    ]
  },
  {
    "name": "Darius",
    "role": "TOP",
    "class": "Lutador / Duelista",
    "description": "Darius é um lutador de alto impacto em all-ins, que domina escaramuças e trades longos na rota superior. Sua passiva e ultimate punem quem fica longe demais em lutas estendidas.\n\nDarius prospera em abates isolados e snowball; jogos em que ele consegue acumular stacks podem se tornar dominantes.",
    "lore": "Darius é um comandante noxiano, conhecido por sua força brutal e ambição no campo de batalha.",
    "forte_contra": [
      "Immobile top laners",
      "Squishy duelists"
    ],
    "fraco_contra": [
      "Kiting champions",
      "Ranged poke"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Thresh"
    ]
  },
  {
    "name": "Diana",
    "role": "TOP/MID",
    "class": "Lutador / Mago",
    "description": "Diana é uma duelista com explosão e mobilidade de engage. Seu pico de dano é quando consegue completar combos enquanto se posiciona no meio da luta.\n\nEm jogos, Diana procura caminhos de entrada que lhe permitam chegar no backline — ela brilha com suporte de front-line.",
    "lore": "Diana busca o poder lunar por cima de tradições antigas e luta para impor sua visão celestial.",
    "forte_contra": [
      "AP squishies",
      "Short trades"
    ],
    "fraco_contra": [
      "Heavy CC",
      "Kite heavy opponents"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Amumu",
      "Sejuani"
    ]
  },
  {
    "name": "Dr. Mundo",
    "role": "TOP/JUNGLE",
    "class": "Tanque / Fighter",
    "description": "Dr. Mundo é um colosso regenerativo que escala com vida máxima e resistência. Ele suga lutas e permanece relevante em trocas prolongadas devido à sua cura inata.\n\nMundo é simples de entender, mas efetivo em teamfights onde consegue sobreviver e distrair o time inimigo.",
    "lore": "Dr. Mundo é um sobrevivente de experimentos, cuja regeneração torna-o uma entidade quase indestrutível.",
    "forte_contra": [
      "Sustained trades",
      "Comps sem grievous wounds"
    ],
    "fraco_contra": [
      "Grievous Wounds items",
      "Kiting"
    ],
    "sinergia_com": [
      "Maokai",
      "Ornn",
      "Sejuani"
    ]
  },
  {
    "name": "Draven",
    "role": "BOT",
    "class": "Atirador / Carry",
    "description": "Draven é um atirador snowball com alto potencial de dano no early game. Ele recompensa jogadas agressivas e abates constantes para manter vantagem de ouro.\n\nEm partidas, cuidar da manutenção dos machados e posicionamento é o diferencial entre um Draven dominante e um que perde espaço.",
    "lore": "Draven é um showman sanguinário que busca fama e glória nas arenas; suas habilidades com machados são lendárias.",
    "forte_contra": [
      "Short-range marksmen",
      "Supports fracos"
    ],
    "fraco_contra": [
      "Assassins",
      "Heavy engage"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Thresh"
    ]
  },
  {
    "name": "Ekko",
    "role": "JUNGLE/MID",
    "class": "Assassino / Fighter",
    "description": "Ekko manipula o tempo para realizar engages, escapes e burst. Ele é forte em skirmishes e picks, com excelente rotação e capacidade de reverter situações desfavoráveis.\n\nControle de distâncias e timing de ultimate definem a diferença entre um Ekko bem-sucedido e um que perde trades.",
    "lore": "Ekko é um prodígio que brinca com o tempo para proteger seu bairro e ajustar eventos do passado.",
    "forte_contra": [
      "Squishy targets",
      "Low mobility"
    ],
    "fraco_contra": [
      "Heavy CC",
      "Long-range poke"
    ],
    "sinergia_com": [
      "Lulu",
      "Leona",
      "Jarvan IV"
    ]
  },
  {
    "name": "Elise",
    "role": "JUNGLE",
    "class": "Mage / Fighter",
    "description": "Elise é uma jungler com forte pressão no early game e potencial de execução em 1v1. Sua forma de aranha oferece burst físico e ferramentas de gank excepcionais.\n\nElise necessita capitalizar no early para prevenir que o jogo chegue em fases onde ela é menos influente.",
    "lore": "Elise é uma criatura sedutora que atrai presas para sua teia, preservando sua juventude e poder através do sacrifício.",
    "forte_contra": [
      "Weak early junglers",
      "Unaware lanes"
    ],
    "fraco_contra": [
      "Late-game hypercarries",
      "High mobility"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Leona",
      "Lulu"
    ]
  },
  {
    "name": "Evelynn",
    "role": "JUNGLE",
    "class": "Assassina / Mage",
    "description": "Evelynn é uma assassina stealth que brilha em picks após nivel 6. Ela necessita de controle de visão inimiga para aplicar pressão e eliminar carregadores desprevenidos.\n\nContra Evelynn, visão e wards de detecção são cruciais; como Evelynn, escolha alvos isolados e capitalize em descuidos.",
    "lore": "Evelynn é um demônio que se alimenta do sofrimento e do desejo humano; sua presença é tanto sensual quanto mortal.",
    "forte_contra": [
      "Low vision teams",
      "Isolated targets"
    ],
    "fraco_contra": [
      "High CC",
      "Reveal vision"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Orianna",
      "Thresh"
    ]
  },
  {
    "name": "Ezreal",
    "role": "BOT/MID",
    "class": "Atirador / Mago",
    "description": "Ezreal é um atirador móvel e skillshot-dependent, com grande potencial de poke e segurança via Arcane Shift. Ele escala bem com itens que maximizam sua saída de dano e sustain com mana.\n\nComo Ezreal, manter distância e acumular recursos antes do mid/late é crucial; contra ele, punir quando o E estiver em cooldown é a jogada certa.",
    "lore": "Ezreal é um aventureiro arqueólogo que usa magia antiga para manipular relíquias e desafiar o desconhecido.",
    "forte_contra": [
      "Short-range melees",
      "Low mobility"
    ],
    "fraco_contra": [
      "Hard engage",
      "Assassins diving the backline"
    ],
    "sinergia_com": [
      "Nami",
      "Yuumi",
      "Thresh"
    ]
  },
  {
    "name": "Fiddlesticks",
    "role": "Jungle",
    "class": "Mago",
    "lore": "O antigo terror das lendas, Fiddlesticks é uma criatura medonha que se alimenta do medo humano. Um espantalho demoníaco que vaga por Runeterra, ele é a própria encarnação do pavor.",
    "description": "Fiddlesticks é um mago de controle voltado para emboscadas e iniciações. Sua ultimate, Tempestade de Corvos, pode virar completamente o rumo de uma luta quando bem posicionada. Ele se fortalece explorando a falta de visão inimiga e punindo adversários desavisados.\n\nAlém disso, ele tem ferramentas de controle e sustain na selva, sendo capaz de sobreviver e crescer até o mid/late game, onde seu impacto é devastador. Jogar contra Fiddlesticks exige cautela constante e bom uso de sentinelas.",
    "forte_contra": [
      "Warwick",
      "Amumu",
      "Master Yi"
    ],
    "fraco_contra": [
      "Evelynn",
      "Kha'Zix",
      "Graves"
    ],
    "sinergia_com": [
      "Malphite",
      "Orianna",
      "Miss Fortune"
    ]
  },
  {
    "name": "Fiora",
    "role": "Top",
    "class": "Duelista",
    "lore": "Fiora é a duelista mais temida de Valoran, conhecida por sua destreza com a espada e por sua busca incansável pela perfeição. Orgulhosa e habilidosa, ela considera qualquer combate uma oportunidade de provar sua superioridade.",
    "description": "Fiora é um dos maiores exemplos de campeão de alta habilidade mecânica. Sua força está no domínio do tempo de reflexos, bloqueando habilidades inimigas com Ripostar e explorando fraquezas do oponente através de sua passiva. Ela é um terror em duelos 1v1 e se destaca em partidas prolongadas.\n\nNas mãos certas, Fiora pode dividir o mapa (split push) e destruir torres rapidamente, forçando o time inimigo a reagir. Porém, sua vulnerabilidade em lutas em grupo exige precisão estratégica de quem a utiliza.",
    "forte_contra": [
      "Nasus",
      "Ornn",
      "Camille"
    ],
    "fraco_contra": [
      "Malphite",
      "Jax",
      "Teemo"
    ],
    "sinergia_com": [
      "Shen",
      "Yuumi",
      "Jarvan IV"
    ]
  },
  {
    "name": "Fizz",
    "role": "Mid",
    "class": "Assassino Mago",
    "lore": "Um yordle travesso que vive entre os recifes de Águas de Sentina, Fizz é um mestre das marés. Muitas vezes confundido com uma simples lenda marinha, ele surge para punir aqueles que desrespeitam o oceano.",
    "description": "Fizz é um assassino ágil e escorregadio, capaz de eliminar alvos frágeis com extrema rapidez. Seu kit permite mergulhar em meio aos inimigos, evitar habilidades com seu Brincalhão/Trapaceiro e aplicar grande explosão mágica.\n\nEle é uma ameaça constante em qualquer fase do jogo. Jogar contra Fizz exige atenção redobrada, já que ele pode sumir da rota e aparecer em qualquer lugar, trazendo caos com seu tubarão. Dominar Fizz é saber quando atacar e quando recuar, controlando o ritmo da partida.",
    "forte_contra": [
      "Lux",
      "Ahri",
      "Syndra"
    ],
    "fraco_contra": [
      "Lissandra",
      "Kassadin",
      "Zed"
    ],
    "sinergia_com": [
      "Amumu",
      "Leona",
      "Malphite"
    ]
  },
  {
    "name": "Galio",
    "role": "MID / SUP",
    "class": "Tank, Mage",
    "lore": "Um colosso de pedra que ganha vida para proteger Demacia, despertando quando a magia se manifesta.",
    "explanation": "Galio é um campeão voltado para resistir a magias e iniciar lutas em grupo. Ele se destaca contra campeões que dependem muito de dano mágico, usando sua passiva e habilidades para absorver e devolver poderosos ataques. Em uma matchup, você deve focar em neutralizar magos frágeis e proteger aliados com sua ultimate.\n\nJogando contra ele, evite depender apenas de habilidades mágicas e tente manter distância para não ser atingido pelo seu engage em área.",
    "forte_contra": [
      "Viktor",
      "Ryze",
      "Orianna"
    ],
    "fraco_contra": [
      "Fiora",
      "Darius",
      "Camille"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Yasuo",
      "Malphite"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Gangplank",
    "role": "TOP",
    "class": "Fighter",
    "lore": "Um lenda dos mares de Águas de Sentina, que usa pólvora e rum para dominar inimigos.",
    "explanation": "Gangplank é um duelista que controla espaço com barris explosivos e tem influência global com sua ultimate. Ele pode escalar forte para o fim do jogo e aplicar pressão constante na rota. O segredo é usar seus barris para zonear o inimigo e acumular ouro com sua passiva e Q.\n\nJogando contra Gangplank, tente destruir seus barris antes que ele os acione e pressione-o no início, pois ele precisa de itens para se tornar uma ameaça real.",
    "forte_contra": [
      "Nasus",
      "Shen",
      "Cho'Gath"
    ],
    "fraco_contra": [
      "Renekton",
      "Irelia",
      "Camille"
    ],
    "sinergia_com": [
      "Twisted Fate",
      "Nocturne",
      "Miss Fortune"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Garen",
    "role": "TOP",
    "class": "Tank, Fighter",
    "lore": "Um guerreiro de Demacia, símbolo de lealdade e coragem, que luta sem magia e com pura força.",
    "explanation": "Garen é simples e direto: resistência alta, regeneração e muito dano verdadeiro com sua ultimate. Ele pressiona rotas laterais e pode eliminar alvos frágeis rapidamente. Use sua passiva para regenerar vida e busque trocas curtas.\n\nContra Garen, abuse da sua falta de mobilidade. Campeões com alcance ou controle de grupo são boas escolhas para enfraquecê-lo.",
    "forte_contra": [
      "Darius",
      "Nasus",
      "Tryndamere"
    ],
    "fraco_contra": [
      "Teemo",
      "Quinn",
      "Kayle"
    ],
    "sinergia_com": [
      "Lux",
      "Jarvan IV",
      "Amumu"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Gnar",
    "role": "TOP",
    "class": "Fighter, Tank",
    "lore": "Um yordle primitivo que se transforma em uma fera colossal quando irritado.",
    "explanation": "Gnar alterna entre sua forma Mini (com mobilidade e ataques à distância) e Mega (tanque com controle de grupo). Ele é muito versátil e pode dominar a rota com kite e trocas rápidas. Sua ultimate é devastadora em lutas de equipe.\n\nJogando contra Gnar, aproveite janelas em que ele está fora da forma Mega e force lutas rápidas antes da transformação.",
    "forte_contra": [
      "Shen",
      "Renekton",
      "Malphite"
    ],
    "fraco_contra": [
      "Camille",
      "Jayce",
      "Irelia"
    ],
    "sinergia_com": [
      "Orianna",
      "Jarvan IV",
      "Sejuani"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Gragas",
    "role": "JUNGLE / TOP / MID",
    "class": "Mage, Tank",
    "lore": "Um beberrão vastaya que adora combates e experimentos com barris de álcool explosivo.",
    "explanation": "Gragas é flexível, podendo jogar como tanque ou mago explosivo. Seu kit oferece sustain, engage e desengage. A ultimate pode decidir lutas ao separar o time inimigo.\n\nContra ele, desvie de sua barrigada e poke constante. Pressioná-lo no início pode atrasar sua progressão.",
    "forte_contra": [
      "Lee Sin",
      "Kayn",
      "Evelynn"
    ],
    "fraco_contra": [
      "Morgana",
      "Trundle",
      "Olaf"
    ],
    "sinergia_com": [
      "Yasuo",
      "Miss Fortune",
      "Orianna"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Graves",
    "role": "JUNGLE",
    "class": "Marksman, Fighter",
    "lore": "Um fora da lei de Águas de Sentina, conhecido por sua espingarda de dispersão.",
    "explanation": "Graves é um caçador forte no início e médio jogo, com clear rápido e duelos poderosos. Seu dash e resistência a projéteis o tornam seguro em confrontos. É excelente em dominar a selva inimiga e pressionar objetivos.\n\nContra Graves, evite duelos diretos e abuse de campeões com alcance ou controle de grupo.",
    "forte_contra": [
      "Lee Sin",
      "Xin Zhao",
      "Kha'Zix"
    ],
    "fraco_contra": [
      "Rammus",
      "Zac",
      "Lillia"
    ],
    "sinergia_com": [
      "Twisted Fate",
      "Thresh",
      "Leona"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Gwen",
    "role": "TOP",
    "class": "Fighter, Mage",
    "lore": "Uma boneca encantada que ganhou vida e luta com tesouras mágicas.",
    "explanation": "Gwen causa dano verdadeiro com cortes e se protege com sua névoa, tornando-se intocável contra ataques à distância. Ela escala muito bem com itens e pode carregar lutas.\n\nContra ela, tente punir seu fraco início e evite lutar dentro da névoa.",
    "forte_contra": [
      "Sett",
      "Nasus",
      "Malphite"
    ],
    "fraco_contra": [
      "Camille",
      "Fiora",
      "Jax"
    ],
    "sinergia_com": [
      "Yuumi",
      "Lulu",
      "Orianna"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Hecarim",
    "role": "JUNGLE",
    "class": "Fighter, Tank",
    "lore": "Um espectro de cavaleiro que cavalga espalhando terror.",
    "explanation": "Hecarim é um jungler de iniciação, com velocidade altíssima e ultimate de controle em área. Ele pode devastar times frágeis ao entrar com sua carga.\n\nContra ele, evite ficar agrupado e use controles para pará-lo antes do engage.",
    "forte_contra": [
      "Master Yi",
      "Kayn",
      "Evelynn"
    ],
    "fraco_contra": [
      "Trundle",
      "Kindred",
      "Udyr"
    ],
    "sinergia_com": [
      "Galio",
      "Orianna",
      "Miss Fortune"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Heimerdinger",
    "role": "MID / SUP",
    "class": "Mage",
    "lore": "Um inventor yordle genial que domina o campo com suas torretas.",
    "explanation": "Heimerdinger controla espaço como poucos, usando torretas, granadas e foguetes. Ele é forte em zonas fixas e pode dominar rotas com poke.\n\nContra ele, destrua suas torretas rapidamente e force lutas fora de áreas controladas.",
    "forte_contra": [
      "Yasuo",
      "Zed",
      "Katarina"
    ],
    "fraco_contra": [
      "Ziggs",
      "Vel'Koz",
      "Lux"
    ],
    "sinergia_com": [
      "Jinx",
      "Caitlyn",
      "Orianna"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Hwei",
    "role": "MID, MAGE",
    "class": "Mago, Burst",
    "lore": "Hwei é um artista amaldiçoado de Ionia que manipula magia através de suas pinturas, criando realidades efêmeras e mortais.",
    "description": "Hwei tem versatilidade com múltiplas magias, permitindo poke, controle e burst dependendo da situação.",
    "forte_contra": [
      "Orianna",
      "Viktor",
      "Lux"
    ],
    "fraco_contra": [
      "Zed",
      "Katarina",
      "Fizz"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Amumu",
      "Galio"
    ]
  },
  {
    "name": "Illaoi",
    "role": "TOP",
    "class": "Fighter",
    "lore": "A Sacerdotisa do Kraken que invoca tentáculos para esmagar inimigos.",
    "explanation": "Illaoi domina em trocas prolongadas, invocando tentáculos para aplicar enorme dano em área. Ela é extremamente forte em 1v2 e pode virar lutas mesmo em desvantagem.\n\nContra Illaoi, evite lutar em locais apertados e tente abater sua alma rapidamente.",
    "forte_contra": [
      "Nasus",
      "Ornn",
      "Maokai"
    ],
    "fraco_contra": [
      "Fiora",
      "Camille",
      "Vayne"
    ],
    "sinergia_com": [
      "Malphite",
      "Sejuani",
      "Amumu"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Irelia",
    "role": "TOP / MID",
    "class": "Fighter, Assassin",
    "lore": "A Dançarina das Lâminas de Ionia, que luta pela liberdade com maestria incomparável.",
    "explanation": "Irelia é uma duelista ágil que reseta suas habilidades ao matar tropas e aplica muito dano verdadeiro. Ela é poderosa em 1v1 e escalada para teamfights.\n\nContra ela, evite deixar tropas disponíveis para resets e use controles fortes para pará-la.",
    "forte_contra": [
      "Ryze",
      "Akali",
      "Sylas"
    ],
    "fraco_contra": [
      "Malzahar",
      "Sett",
      "Pantheon"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Sejuani",
      "Galio"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Ivern",
    "role": "JUNGLE",
    "class": "Support, Mage",
    "lore": "O guardião da floresta, um ser pacífico que liberta criaturas da selva.",
    "explanation": "Ivern é um jungler único, que não mata monstros, mas os liberta. Ele protege e fortalece aliados com escudos e controles, além de Daisy, sua companheira elemental.\n\nContra ele, aproveite seu início fraco e pressione a selva.",
    "forte_contra": [
      "Evelynn",
      "Master Yi",
      "Kayn"
    ],
    "fraco_contra": [
      "Nidalee",
      "Lee Sin",
      "Elise"
    ],
    "sinergia_com": [
      "Rengar",
      "Kog'Maw",
      "Lulu"
    ],
    "description": "Descrição não disponível."
  },
  {
    "name": "Janna",
    "role": "SUPPORT",
    "class": "Mago, Suporte",
    "lore": "Janna é a manifestação do vento em Runeterra. Protetora dos necessitados, ela usa suas forças para ajudar os mais fracos contra adversidades.",
    "description": "Janna é uma campeã de utilidade extrema, fornecendo escudos, cura e controle de grupo. Ela é ótima contra engages pesados, podendo anular iniciações inimigas com seu tornado ou ultimate.",
    "forte_contra": [
      "Leona",
      "Nautilus",
      "Alistar"
    ],
    "fraco_contra": [
      "Zyra",
      "Brand",
      "Vel'Koz"
    ],
    "sinergia_com": [
      "Jinx",
      "Caitlyn",
      "Kog'Maw"
    ]
  },
  {
    "name": "Jarvan IV",
    "role": "JUNGLE",
    "class": "Lutador, Tank",
    "lore": "Jarvan IV é o príncipe herdeiro de Demacia. Um líder nato, inspira suas tropas em batalhas épicas pelo seu reino.",
    "description": "Jarvan é um iniciador nato. Seu combo de bandeira + dragão é excelente para travar adversários e forçar lutas em equipe. Tem sinergia com campeões que podem seguir seu engage.",
    "forte_contra": [
      "Graves",
      "Kha'Zix",
      "Rengar"
    ],
    "fraco_contra": [
      "Trundle",
      "Poppy",
      "Olaf"
    ],
    "sinergia_com": [
      "Orianna",
      "Miss Fortune",
      "Galio"
    ]
  },
  {
    "name": "Jax",
    "role": "TOP",
    "class": "Lutador, Duelista",
    "lore": "Jax é o maior mestre de armas vivo, empunhando apenas um poste de lâmpada. Ninguém sobrevive em duelos prolongados contra ele.",
    "description": "Jax é um duelista excepcional. Ele escala fortemente no jogo e consegue vencer a maioria dos campeões em lutas longas. Deve evitar ser controlado antes de engajar.",
    "forte_contra": [
      "Camille",
      "Irelia",
      "Fiora"
    ],
    "fraco_contra": [
      "Malphite",
      "Teemo",
      "Quinn"
    ],
    "sinergia_com": [
      "Sejuani",
      "Twisted Fate",
      "Yuumi"
    ]
  },
  {
    "name": "Jayce",
    "role": "TOP, MID",
    "class": "Atirador, Lutador",
    "lore": "Jayce é o defensor de Piltover, mestre da tecnologia Hextech e inventor do Canhão Mercury.",
    "description": "Jayce é flexível, podendo jogar tanto na rota do topo quanto no meio. Ele troca entre martelo e canhão, misturando poke à distância com forte burst corpo a corpo.",
    "forte_contra": [
      "Azir",
      "Ryze",
      "Kennen"
    ],
    "fraco_contra": [
      "Malphite",
      "Sion",
      "Ornn"
    ],
    "sinergia_com": [
      "Elise",
      "Zoe",
      "Lux"
    ]
  },
  {
    "name": "Jhin",
    "role": "BOT",
    "class": "Atirador",
    "lore": "Jhin é um psicopata meticuloso de Ionia que vê assassinatos como uma forma de arte.",
    "description": "Jhin é um ADC único, com apenas 4 tiros por recarregamento. Ele brilha em fights controladas e precisa de bons setups para usar seu ultimate de forma eficaz.",
    "forte_contra": [
      "Ezreal",
      "Varus",
      "Sivir"
    ],
    "fraco_contra": [
      "Draven",
      "Caitlyn",
      "Lucian"
    ],
    "sinergia_com": [
      "Morgana",
      "Thresh",
      "Nami"
    ]
  },
  {
    "name": "Jinx",
    "role": "BOT",
    "class": "Atirador, Carry",
    "lore": "Jinx é uma criminosa de Zaun, caótica e sem limites, obcecada por destruição.",
    "description": "Jinx é uma hipercarry, escalando incrivelmente bem no late game. Quando pega resets em lutas, se torna imparável.",
    "forte_contra": [
      "Aphelios",
      "Ezreal",
      "Ashe"
    ],
    "fraco_contra": [
      "Draven",
      "Lucian",
      "Samira"
    ],
    "sinergia_com": [
      "Lulu",
      "Thresh",
      "Nami"
    ]
  },
  {
    "name": "K'Sante",
    "role": "TOP",
    "class": "Tank, Lutador",
    "lore": "K’Sante é o Orgulho de Nazumah, um guerreiro que luta contra monstros para proteger seu povo.",
    "description": "K’Sante é um tank com mobilidade e forte potencial de duelos. Seu ultimate o transforma em um lutador mais agressivo, sacrificando parte da defesa.",
    "forte_contra": [
      "Ornn",
      "Sion",
      "Malphite"
    ],
    "fraco_contra": [
      "Fiora",
      "Camille",
      "Gwen"
    ],
    "sinergia_com": [
      "Sejuani",
      "Galio",
      "Orianna"
    ]
  },
  {
    "name": "Kai'Sa",
    "role": "BOT",
    "class": "Atirador, Carry",
    "lore": "Kai'Sa sobreviveu ao Vazio e se tornou sua filha, equilibrando entre humanidade e o poder da escuridão.",
    "description": "Kai'Sa é versátil, adaptando builds de acordo com a situação. Tem grande potencial de burst e mobilidade com seu ultimate.",
    "forte_contra": [
      "Ezreal",
      "Varus",
      "Aphelios"
    ],
    "fraco_contra": [
      "Draven",
      "Caitlyn",
      "Samira"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Alistar"
    ]
  },
  {
    "name": "Kalista",
    "role": "BOT",
    "class": "Atirador",
    "lore": "Kalista é o espírito da vingança, caçando traidores e cumprindo pactos de sangue.",
    "description": "Kalista é altamente móvel com sua passiva, mas exige sinergia com o suporte para funcionar bem. Seu ultimate pode salvar aliados ou iniciar lutas.",
    "forte_contra": [
      "Jhin",
      "Ashe",
      "Varus"
    ],
    "fraco_contra": [
      "Ezreal",
      "Kai'Sa",
      "Lucian"
    ],
    "sinergia_com": [
      "Thresh",
      "Alistar",
      "Leona"
    ]
  },
  {
    "name": "Karma",
    "role": "SUPPORT, MID",
    "class": "Mago, Suporte",
    "lore": "Karma é a líder espiritual de Ionia, encarnação de sua alma coletiva.",
    "description": "Karma é versátil, com escudos poderosos e poke constante. Pode jogar tanto como suporte quanto como mago de controle no mid.",
    "forte_contra": [
      "Thresh",
      "Yuumi",
      "Morgana"
    ],
    "fraco_contra": [
      "Brand",
      "Zyra",
      "Vel'Koz"
    ],
    "sinergia_com": [
      "Ezreal",
      "Caitlyn",
      "Jhin"
    ]
  },
  {
    "name": "Karthus",
    "role": "JUNGLE, MID",
    "class": "Mago",
    "lore": "Karthus é o Arauto da Morte, celebrando o fim da vida com seu canto macabro.",
    "description": "Karthus é frágil, mas extremamente impactante com sua ultimate global. Deve farmar com segurança e buscar causar dano mesmo após morrer.",
    "forte_contra": [
      "Amumu",
      "Sejuani",
      "Rammus"
    ],
    "fraco_contra": [
      "Evelynn",
      "Kha'Zix",
      "Nidalee"
    ],
    "sinergia_com": [
      "Amumu",
      "Orianna",
      "Miss Fortune"
    ]
  },
  {
    "name": "Kassadin",
    "role": "MID",
    "class": "Assassino, Mago",
    "lore": "Kassadin jurou destruir o Vazio após perder sua família e lar para suas criaturas.",
    "description": "Kassadin é um counter natural de magos, ficando imbatível no late game. Seu ponto fraco é o early extremamente vulnerável.",
    "forte_contra": [
      "Ryze",
      "Viktor",
      "Anivia"
    ],
    "fraco_contra": [
      "Talon",
      "Fizz",
      "LeBlanc"
    ],
    "sinergia_com": [
      "Sejuani",
      "Galio",
      "Jarvan IV"
    ]
  },
  {
    "name": "Katarina",
    "role": "MID",
    "class": "Assassina",
    "lore": "Katarina é uma assassina de Noxus, conhecida por sua velocidade e precisão mortais.",
    "description": "Katarina é um snowballer clássico: se pegar resets, limpa lutas inteiras. No entanto, é muito vulnerável a controles de grupo.",
    "forte_contra": [
      "Lux",
      "Syndra",
      "Orianna"
    ],
    "fraco_contra": [
      "Lissandra",
      "Malzahar",
      "Annie"
    ],
    "sinergia_com": [
      "Amumu",
      "Malphite",
      "Galio"
    ]
  },
  {
    "name": "Kayle",
    "role": "TOP, MID",
    "class": "Lutadora, Carry",
    "lore": "Kayle é a filha da justiça, uma guerreira celestial que julga os indignos.",
    "description": "Kayle é fraca no early, mas se transforma em uma das carries mais fortes do late game. Precisa de tempo para escalar.",
    "forte_contra": [
      "Nasus",
      "Cho'Gath",
      "Sion"
    ],
    "fraco_contra": [
      "Fiora",
      "Renekton",
      "Irelia"
    ],
    "sinergia_com": [
      "Yuumi",
      "Lulu",
      "Janna"
    ]
  },
  {
    "name": "Kayn",
    "role": "JUNGLE",
    "class": "Assassino, Lutador",
    "lore": "Kayn empunha a foice Rhaast, lutando contra a corrupção do Vazio dentro de si.",
    "description": "Kayn é versátil: pode escolher entre forma de assassino para eliminar alvos frágeis ou forma Rhaast para ser um lutador mais resistente.",
    "forte_contra": [
      "Graves",
      "Evelynn",
      "Master Yi"
    ],
    "fraco_contra": [
      "Udyr",
      "Warwick",
      "Xin Zhao"
    ],
    "sinergia_com": [
      "Yasuo",
      "Yone",
      "Orianna"
    ]
  },
  {
    "name": "Kennen",
    "role": "TOP, MID",
    "class": "Mago, Lutador",
    "lore": "Kennen é o coração da tempestade, um ninja ioniano que canaliza eletricidade.",
    "description": "Kennen é excelente em lutas em equipe, com engage em área devastador. Porém, é relativamente frágil.",
    "forte_contra": [
      "Gnar",
      "Teemo",
      "Jayce"
    ],
    "fraco_contra": [
      "Malphite",
      "Rumble",
      "Renekton"
    ],
    "sinergia_com": [
      "Amumu",
      "Orianna",
      "Jarvan IV"
    ]
  },
  {
    "name": "Kha'Zix",
    "role": "JUNGLE",
    "class": "Assassino",
    "lore": "Kha'Zix é uma criatura do Vazio que evolui ao devorar os mais fortes.",
    "description": "Kha'Zix é um assassino furtivo que brilha em alvos isolados. Pode evoluir habilidades e se adaptar ao jogo.",
    "forte_contra": [
      "Evelynn",
      "Master Yi",
      "Shaco"
    ],
    "fraco_contra": [
      "Rammus",
      "Warwick",
      "Udyr"
    ],
    "sinergia_com": [
      "Zed",
      "Talon",
      "LeBlanc"
    ]
  },
  {
    "name": "Kindred",
    "role": "JUNGLE",
    "class": "Atirador, Lutador",
    "lore": "Kindred representa as gêmeas eternas: o Arqueiro (Vida) e o Lobo (Morte).",
    "description": "Kindred é um caçador único, focado em acumular marcas e escalar. Seu ultimate pode salvar aliados e mudar lutas.",
    "forte_contra": [
      "Amumu",
      "Sejuani",
      "Nunu"
    ],
    "fraco_contra": [
      "Kha'Zix",
      "Rengar",
      "Graves"
    ],
    "sinergia_com": [
      "Lulu",
      "Yuumi",
      "Thresh"
    ]
  },
  {
    "name": "Kled",
    "role": "TOP",
    "class": "Lutador",
    "lore": "Kled é um yordle de Noxus, guerreiro insano que nunca recua, montado em sua fiel Skaarl.",
    "description": "Kled é um lutador agressivo, com alta mobilidade e potencial de all-in. Sua montaria cria uma dinâmica única de sustain.",
    "forte_contra": [
      "Teemo",
      "Jayce",
      "Gnar"
    ],
    "fraco_contra": [
      "Malphite",
      "Fiora",
      "Camille"
    ],
    "sinergia_com": [
      "Sejuani",
      "Galio",
      "Jarvan IV"
    ]
  },
  {
    "name": "Kog'Maw",
    "role": "BOT",
    "class": "Atirador",
    "lore": "Kog'Maw é uma aberração do Vazio, cuspindo ácido corrosivo em seus inimigos.",
    "description": "Kog'Maw é um hypercarry de longo alcance, mas extremamente frágil. Depende de proteção da equipe para brilhar.",
    "forte_contra": [
      "Ashe",
      "Varus",
      "Jinx"
    ],
    "fraco_contra": [
      "Draven",
      "Caitlyn",
      "Lucian"
    ],
    "sinergia_com": [
      "Lulu",
      "Janna",
      "Nami"
    ]
  },
  {
    "name": "LeBlanc",
    "role": "MID",
    "class": "Assassina, Mago",
    "lore": "LeBlanc é a líder do Povo das Sombras, mestra da ilusão e manipulação.",
    "description": "LeBlanc é uma assassina de burst rápido, mas depende de acertar suas habilidades. Excelente em pickoffs e snowball.",
    "forte_contra": [
      "Lux",
      "Syndra",
      "Zoe"
    ],
    "fraco_contra": [
      "Malzahar",
      "Lissandra",
      "Galio"
    ],
    "sinergia_com": [
      "Evelynn",
      "Kha'Zix",
      "Jarvan IV"
    ]
  },
  {
    "name": "Lee Sin",
    "role": "JUNGLE",
    "class": "Lutador, Assassino",
    "lore": "Lee Sin é um monge cego ioniano, mestre nas artes marciais e da energia espiritual.",
    "description": "Lee Sin é um dos junglers mais mecânicos, com grande mobilidade e potencial de jogadas. Brilha no early game.",
    "forte_contra": [
      "Evelynn",
      "Kha'Zix",
      "Graves"
    ],
    "fraco_contra": [
      "Trundle",
      "Warwick",
      "Nunu"
    ],
    "sinergia_com": [
      "Yasuo",
      "Orianna",
      "Alistar"
    ]
  },
  {
    "name": "Leona",
    "role": "SUPPORT",
    "class": "Tank, Suporte",
    "lore": "Leona é a campeã do Sol, defensora de Targon, que brilha com o poder da luz.",
    "description": "Leona é uma das suportes de engage mais fortes. Tem muito CC e sinergia com ADCs agressivos.",
    "forte_contra": [
      "Janna",
      "Nami",
      "Yuumi"
    ],
    "fraco_contra": [
      "Morgana",
      "Lulu",
      "Tahm Kench"
    ],
    "sinergia_com": [
      "Draven",
      "Kalista",
      "Kai'Sa"
    ]
  },
  {
    "name": "Lillia",
    "role": "JUNGLE, TOP",
    "class": "Lutadora, Mago",
    "lore": "Lillia é uma faunesa sonhadora, portadora da magia dos sonhos da Árvore dos Sonhos.",
    "description": "Lillia tem alto dano mágico em área e mobilidade com sua passiva. Seu ultimate é devastador em lutas em equipe.",
    "forte_contra": [
      "Amumu",
      "Rammus",
      "Sejuani"
    ],
    "fraco_contra": [
      "Kha'Zix",
      "Elise",
      "Lee Sin"
    ],
    "sinergia_com": [
      "Orianna",
      "Yasuo",
      "Miss Fortune"
    ]
  },
  {
    "name": "Lissandra",
    "role": "MID",
    "class": "Mago, Controle",
    "lore": "Lissandra é a Bruxa do Gelo, conspirando para trazer a era da escuridão eterna.",
    "description": "Lissandra é ótima em controle de grupo e iniciações. Pode travar assassinos e proteger a backline.",
    "forte_contra": [
      "Zed",
      "Katarina",
      "Fizz"
    ],
    "fraco_contra": [
      "Anivia",
      "Syndra",
      "Xerath"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Sejuani",
      "Amumu"
    ]
  },
  {
    "name": "Lucian",
    "role": "BOT, MID",
    "class": "Atirador",
    "lore": "Lucian é um caçador de espectros, empunhando duas pistolas relicárias contra as trevas.",
    "description": "Lucian é um ADC agressivo, ótimo em early game. Brilha em trocas rápidas e tem mobilidade para sobreviver.",
    "forte_contra": [
      "Jhin",
      "Ezreal",
      "Varus"
    ],
    "fraco_contra": [
      "Draven",
      "Samira",
      "Kai'Sa"
    ],
    "sinergia_com": [
      "Nami",
      "Braum",
      "Yuumi"
    ]
  },
  {
    "name": "Lulu",
    "role": "SUPPORT",
    "class": "Mago, Suporte",
    "lore": "Lulu é uma yordle encantadora que molda a realidade com sua magia feérica.",
    "description": "Lulu é uma das melhores encantadoras, oferecendo buffs e proteção. Brilha quando combinada com hipercarries.",
    "forte_contra": [
      "Leona",
      "Nautilus",
      "Thresh"
    ],
    "fraco_contra": [
      "Brand",
      "Zyra",
      "Blitzcrank"
    ],
    "sinergia_com": [
      "Kog'Maw",
      "Jinx",
      "Vayne"
    ]
  },
  {
    "name": "Lux",
    "role": "MID, SUPPORT",
    "class": "Mago",
    "lore": "Lux é a Dama da Luz de Demacia, controlando magia brilhante para proteger seu povo.",
    "description": "Lux é uma maga de poke e controle, podendo ser suporte ou midlaner. Seu ultimate é devastador em lutas de longa distância.",
    "forte_contra": [
      "Veigar",
      "Orianna",
      "Karthus"
    ],
    "fraco_contra": [
      "Fizz",
      "Talon",
      "Katarina"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Ezreal",
      "Jinx"
    ]
  },
  {
    "name": "Malphite",
    "role": "TOP, TANK",
    "class": "Tanque, Lutador",
    "lore": "Malphite é uma criatura de rocha viva, emergindo da terra para esmagar seus inimigos.",
    "description": "Malphite é um tanque de iniciação com ótimo ult de engage e boa resistência.",
    "forte_contra": [
      "Quinn",
      "Jax",
      "Tryndamere"
    ],
    "fraco_contra": [
      "Nasus",
      "Sion",
      "Camille"
    ],
    "sinergia_com": [
      "Orianna",
      "Jarvan IV",
      "Morgana"
    ]
  },
  {
    "name": "Malzahar",
    "role": "MID",
    "class": "Mago",
    "lore": "Malzahar é o profeta do Vazio, um vidente que busca unir toda a vida em um só propósito através da influência do Vazio.",
    "description": "Malzahar é um mago de controle com dano em área, grande pressão de rota e uma ultimate poderosa de supressão.",
    "forte_contra": [
      "Lux",
      "Veigar",
      "Orianna"
    ],
    "fraco_contra": [
      "Zed",
      "LeBlanc",
      "Fizz"
    ],
    "sinergia_com": [
      "Amumu",
      "Jarvan IV",
      "Sejuani"
    ]
  },
  {
    "name": "Maokai",
    "role": "TOP, SUPPORT, TANK",
    "class": "Tanque, Controlador",
    "lore": "Maokai é um espírito vegetal que busca purificar a corrupção que assola a natureza.",
    "description": "Maokai é um tanque com bastante controle de grupo e sustain, bom para frontlines.",
    "forte_contra": [
      "Darius",
      "Illaoi",
      "Sett"
    ],
    "fraco_contra": [
      "Vayne",
      "Camille",
      "Karina"
    ],
    "sinergia_com": [
      "Ezreal",
      "Vayne",
      "Thresh"
    ]
  },
  {
    "name": "Master Yi",
    "role": "JUNGLE",
    "class": "Assassino, Lutador",
    "lore": "Master Yi é um espada mestre do culto de Ionian, especializado em golpes rápidos e disciplina.",
    "description": "Master Yi escala fortemente e é mortal em lutas em 1v1, mas é vulnerável a controle de grupo.",
    "forte_contra": [
      "Kog’Maw",
      "Jinx",
      "Draven"
    ],
    "fraco_contra": [
      "Morgana",
      "Lissandra",
      "Ashe"
    ],
    "sinergia_com": [
      "Nunu",
      "Thresh",
      "Lulu"
    ]
  },
  {
    "name": "Mel",
    "role": "MID, MAGE",
    "class": "Mago, Controlador",
    "lore": "Mel Medarda é uma estrategista de Noxus que, após se afastar de sua família, estabeleceu poder político em Piltover. Conhecida por sua inteligência afiada e carisma, ela influencia conflitos e alianças por meio da diplomacia e da manipulação.",
    "description": "Mel é uma maga de controle com foco em utilidade, manipulação de espaço e suporte mágico em teamfights.",
    "forte_contra": [
      "Lux",
      "Orianna",
      "Seraphine"
    ],
    "fraco_contra": [
      "Zed",
      "Fizz",
      "Talon"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Caitlyn",
      "Jayce"
    ]
  },
  {
    "name": "Milio",
    "role": "SUPPORT, MAGE",
    "class": "Suporte, Encantador",
    "lore": "Milio é um garoto de Ixtal que viaja com sua mochila mágica, usando o fogo suave de suas chamas familiares para curar feridas e acalmar corações.",
    "description": "Milio é um suporte encantador focado em cura, escudos e fortalecimento de aliados, especialmente ADCs frágeis.",
    "forte_contra": [
      "Leona",
      "Nautilus",
      "Alistar"
    ],
    "fraco_contra": [
      "Blitzcrank",
      "Pyke",
      "Brand"
    ],
    "sinergia_com": [
      "Kai'Sa",
      "Ezreal",
      "Jinx"
    ]
  },
  {
    "name": "Miss Fortune",
    "role": "ADC",
    "class": "Atirador",
    "lore": "Miss Fortune é uma pirata implacável em busca de vingança, usando balas e charme para dominar.",
    "description": "Miss Fortune oferece ótimo dano de área com seu Q e ultimate, especial em lutas em equipe.",
    "forte_contra": [
      "Sivir",
      "Jhin",
      "Ashe"
    ],
    "fraco_contra": [
      "Caitlyn",
      "Draven",
      "Lucian"
    ],
    "sinergia_com": [
      "Leona",
      "Thresh",
      "Nami"
    ]
  },
  {
    "name": "Mordekaiser",
    "role": "TOP, JUNGLE",
    "class": "Lutador, Mago",
    "lore": "Mordekaiser é um lorde ressuscitado, comandante de legiões de mortos e mestre da necromancia metálica.",
    "description": "Mordekaiser é resistente, com alto dano sustentado e uma ultimate que isola inimigos em duelos forçados.",
    "forte_contra": [
      "Nasus",
      "Sion",
      "Malphite"
    ],
    "fraco_contra": [
      "Fiora",
      "Vayne",
      "Camille"
    ],
    "sinergia_com": [
      "Amumu",
      "Orianna",
      "Swain"
    ]
  },
  {
    "name": "Morgana",
    "role": "SUPPORT, MID",
    "class": "Mago, Controlador",
    "lore": "Morgana é uma feiticeira vingativa que manipula trevas, buscando justiça segundo seus próprios termos.",
    "description": "Morgana oferece escudo negro, raízes e controle pesado — ótima contra composições baseadas em controle.",
    "forte_contra": [
      "Leona",
      "Blitzcrank",
      "Thresh"
    ],
    "fraco_contra": [
      "Soraka",
      "Janna",
      "Nami"
    ],
    "sinergia_com": [
      "Ezreal",
      "Vayne",
      "Lucian"
    ]
  },
  {
    "name": "Naafiri",
    "role": "MID, ASSASSIN",
    "class": "Assassino",
    "lore": "Naafiri é uma matilha de cães das areias fundidos por magia sombria do Vazio, caçando em unidade como um único ser consciente.",
    "description": "Naafiri é um assassino simples e eficiente, com alta mobilidade e pressão de mapa, ótima para jogadores que gostam de picks diretos.",
    "forte_contra": [
      "Lux",
      "Xerath",
      "Orianna"
    ],
    "fraco_contra": [
      "Malzahar",
      "Lissandra",
      "Annie"
    ],
    "sinergia_com": [
      "Nocturne",
      "Kha'Zix",
      "Rengar"
    ]
  },
  {
    "name": "Nami",
    "role": "SUPPORT",
    "class": "Suporte, Mago",
    "lore": "Nami é uma vastaya dos mares que invoca o poder da água para curar aliados e afogar inimigos.",
    "description": "Nami é uma encantadora de longo alcance, com cura, buffs e controle de grupo confiável.",
    "forte_contra": [
      "Leona",
      "Nautilus",
      "Alistar"
    ],
    "fraco_contra": [
      "Blitzcrank",
      "Pyke",
      "Brand"
    ],
    "sinergia_com": [
      "Lucian",
      "Ezreal",
      "Kai'Sa"
    ]
  },
  {
    "name": "Nasus",
    "role": "TOP, JUNGLE",
    "class": "Lutador, Tank",
    "lore": "Nasus é um ascendente de Shurima com cabeça de chacal, guardião de conhecimento milenar.",
    "description": "Nasus escala infinitamente com seu Q, tornando-se imparável no late game se conseguir farmar bem.",
    "forte_contra": [
      "Yorick",
      "Sion",
      "Malphite"
    ],
    "fraco_contra": [
      "Teemo",
      "Vayne",
      "Quinn"
    ],
    "sinergia_com": [
      "Amumu",
      "Orianna",
      "Morgana"
    ]
  },
  {
    "name": "Nautilus",
    "role": "SUPPORT, TANK",
    "class": "Tanque, Suporte",
    "lore": "Nautilus é um colosso submerso, surgindo das profundezas para punir os que se destinam ao mar.",
    "description": "Nautilus tem muito controle de grupo e iniciação — um dos suportes mais perigosos de engage.",
    "forte_contra": [
      "Janna",
      "Nami",
      "Soraka"
    ],
    "fraco_contra": [
      "Blitzcrank",
      "Thresh",
      "Alistar"
    ],
    "sinergia_com": [
      "Kai’Sa",
      "Caitlyn",
      "Jinx"
    ]
  },
  {
    "name": "Neeko",
    "role": "MID, SUPPORT",
    "class": "Mago, Camaleão",
    "lore": "Neeko é uma vastaya que absorve traços de formas ao seu redor, engana seus oponentes com ilusões.",
    "description": "Neeko é encantadora com alta capacidade de controle e dano em área com sua ultimate.",
    "forte_contra": [
      "Zyra",
      "Brand",
      "Vel’Koz"
    ],
    "fraco_contra": [
      "LeBlanc",
      "Fizz",
      "Syndra"
    ],
    "sinergia_com": [
      "Galio",
      "Ornn",
      "Jarvan IV"
    ]
  },
  {
    "name": "Nidalee",
    "role": "JUNGLE, MID",
    "class": "Assassino, Mago",
    "lore": "Nidalee é uma caçadora primal que se transforma em puma, perseguindo suas presas com ferocidade.",
    "description": "Nidalee é excelente no early game e nos embates solos, com alta mobilidade e dano explosivo.",
    "forte_contra": [
      "Olaf",
      "Udyr",
      "Warwick"
    ],
    "fraco_contra": [
      "Lee Sin",
      "Kindred",
      "Graves"
    ],
    "sinergia_com": [
      "Sejuani",
      "Jarvan IV",
      "Lillia"
    ]
  },
  {
    "name": "Nilah",
    "role": "ADC",
    "class": "Atirador, Lutador",
    "lore": "Nilah é uma asceta guerreira vinda de terras distantes, que luta em busca de enfrentar monstros ancestrais.",
    "description": "Nilah é uma ADC corpo a corpo com grande sustain, forte em lutas prolongadas e teamfights.",
    "forte_contra": [
      "Kai'Sa",
      "Samira",
      "Sivir"
    ],
    "fraco_contra": [
      "Caitlyn",
      "Draven",
      "Ashe"
    ],
    "sinergia_com": [
      "Nami",
      "Lulu",
      "Milio"
    ]
  },
  {
    "name": "Nocturne",
    "role": "JUNGLE, ASSASSIN",
    "class": "Assassino, Sombrio",
    "lore": "Nocturne é a personificação do medo noturno, envolto em escuridão e caos ao amanhecer.",
    "description": "Nocturne tem ultimate que permite atravessar a selva inimiga e surpreender, focando em eliminar alvos frágeis.",
    "forte_contra": [
      "Caitlyn",
      "Jinx",
      "Ashe"
    ],
    "fraco_contra": [
      "Zed",
      "Kassadin",
      "Fiora"
    ],
    "sinergia_com": [
      "Lulu",
      "Thresh",
      "Morgana"
    ]
  },
  {
    "name": "Nunu & Willump",
    "role": "JUNGLE",
    "class": "Tanque, Suporte",
    "lore": "Nunu é um garoto e Willump um yeti; juntos exploram a tundra e lutam com força e amizade.",
    "description": "Nunu & Willump oferecem controle de mapa, utilidade e abatem monstros e objetivos rapidamente.",
    "forte_contra": [
      "Jungle comps de dano leve",
      "Invade vulneráveis"
    ],
    "fraco_contra": [
      "Campeões agressivos early",
      "Assassinos"
    ],
    "sinergia_com": [
      "Kindred",
      "Karma",
      "Lulu"
    ]
  },
  {
    "name": "Olaf",
    "role": "JUNGLE, TOP, FIGHTER",
    "class": "Lutador, Bárbaro",
    "lore": "Olaf é um guerreiro feroz de Freljord, consumido por fúria contra aqueles que o subestimam.",
    "description": "Olaf é um lutador que não recua — com seu ultimate imune a controle, pressiona e domina adversários.",
    "forte_contra": [
      "Jax",
      "Camille",
      "Vayne"
    ],
    "fraco_contra": [
      "Malphite",
      "Ornn",
      "Sion"
    ],
    "sinergia_com": [
      "Thresh",
      "Alistar",
      "Lulu"
    ]
  },
  {
    "name": "Orianna",
    "role": "MID",
    "class": "Mago, Controlador",
    "lore": "Orianna é uma autômata de Piltover, criada para substituir a vida que perdeu, manipulando sua esfera mágica em batalha.",
    "description": "Orianna é uma maga de controle, com utilidade em área, ótimo poke e uma ultimate de grande impacto.",
    "forte_contra": [
      "Lux",
      "Syndra",
      "Azir"
    ],
    "fraco_contra": [
      "Zed",
      "Fizz",
      "LeBlanc"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Malphite",
      "Rakan"
    ]
  },
  {
    "name": "Ornn",
    "role": "TOP, TANK",
    "class": "Tanque, Suporte",
    "lore": "Ornn é o semideus da forja e do vulcão em Freljord, criando armas e desafiando titãs.",
    "description": "Ornn é um tanque com forte presença em teamfights, capaz de fortalecer itens aliados e iniciar lutas com seu ultimate.",
    "forte_contra": [
      "Camille",
      "Fiora",
      "Irelia"
    ],
    "fraco_contra": [
      "Vayne",
      "Kayle",
      "Teemo"
    ],
    "sinergia_com": [
      "Sejuani",
      "Jarvan IV",
      "Malphite"
    ]
  },
  {
    "name": "Pantheon",
    "role": "TOP, MID, SUPPORT, JUNGLE, FIGHTER, ASSASSIN",
    "class": "Lutador, Assassino",
    "lore": "Pantheon é a encarnação da vontade guerreira de uma divindade caída, um espírito forjado para guerrear sem descanso.",
    "description": "Pantheon é muito forte no early game, com excelente poke, burst e capacidade de dominação em rota. Scales menos em lates tão extremos.",
    "forte_contra": [
      "Darius",
      "Olaf",
      "Renekton"
    ],
    "fraco_contra": [
      "Teemo",
      "Quinn",
      "Fiora"
    ],
    "sinergia_com": [
      "Leona",
      "Thresh",
      "Nami"
    ]
  },
  {
    "name": "Poppy",
    "role": "TOP, JUNGLE, SUPPORT, TANK",
    "class": "Tanque",
    "lore": "Poppy é uma martelo-portadora yordle que busca heróis dignos de carregar o lendário martelo de Orlon, protegendo o mundo contra os que abusam do poder.",
    "description": "Poppy é excelente em isolar uma ameaça, interromper investidas com controle de grupo forte, and sendo muito resistente.",
    "forte_contra": [
      "Camille",
      "Irelia",
      "Jax"
    ],
    "fraco_contra": [
      "Vayne",
      "Quinn",
      "Riven"
    ],
    "sinergia_com": [
      "Kai’Sa",
      "Lucian",
      "Thresh"
    ]
  },
  {
    "name": "Pyke",
    "role": "SUPPORT, ASSASSIN",
    "class": "Assassino, Suporte",
    "lore": "Pyke é um carrasco espectral das profundezas de Bilgewater, buscando justiça para os afogados que foram esquecidos.",
    "description": "Pyke oferece grande roam, pick potential com sua ultimate global e capacidade de fechar abates rapidamente.",
    "forte_contra": [
      "Leona",
      "Thresh",
      "Nautilus"
    ],
    "fraco_contra": [
      "Janna",
      "Soraka",
      "Nami"
    ],
    "sinergia_com": [
      "Lucian",
      "Kai’Sa",
      "Miss Fortune"
    ]
  },
  {
    "name": "Qiyana",
    "role": "MID, ASSASSIN, FIGHTER",
    "class": "Assassino",
    "lore": "Qiyana é a Imperatriz dos Elementos, governando com arrogância sobre Ixaocan e manipulando a natureza a seu favor.",
    "description": "Qiyana é móvel, bursty e pode transformar o ambiente para potencializar suas habilidades. Muito perigosa em rotação e snowball.",
    "forte_contra": [
      "Akali",
      "Zed",
      "Yasuo"
    ],
    "fraco_contra": [
      "Galio",
      "Fizz",
      "Kassadin"
    ],
    "sinergia_com": [
      "Gnar",
      "Jarvan IV",
      "Orianna"
    ]
  },
  {
    "name": "Quinn",
    "role": "TOP, ADC, FIGHTER, MARKSMAN",
    "class": "Atirador, Lutador",
    "lore": "Quinn é uma vigia avizinha, patrulheira dos céus com sua companheira corvo, mantendo sua terra livre de ameaças.",
    "description": "Quinn tem mobilidade alta, excelente para rotas laterais e emboscadas, bom split push e pressão de mapa.",
    "forte_contra": [
      "Yasuo",
      "Tryndamere",
      "Fiora"
    ],
    "fraco_contra": [
      "Malphite",
      "Ornn",
      "Sett"
    ],
    "sinergia_com": [
      "Braum",
      "Leona",
      "Thresh"
    ]
  },
  {
    "name": "Rakan",
    "role": "SUPPORT, FIGHTER",
    "class": "Suporte, Lutador",
    "lore": "Rakan é o Charme da Rebelião, um Vastaya carismático em guerra com seu próprio coração, dançando entre a batalha para inspirar e proteger.",
    "description": "Rakan tem ótimo engage, mobilidade e utilidade em lutas de equipe, além de poder curar e proteger aliados.",
    "forte_contra": [
      "Blitzcrank",
      "Thresh",
      "Leona"
    ],
    "fraco_contra": [
      "Alistar",
      "Nautilus",
      "Pyke"
    ],
    "sinergia_com": [
      "Xayah",
      "Kai’Sa",
      "Ezreal"
    ]
  },
  {
    "name": "Rammus",
    "role": "JUNGLE, TANK",
    "class": "Tanque",
    "lore": "Rammus é uma criatura lacônica do deserto. Seu escudo espinhoso e rotação o tornam temido por quem desafia o vazio ou a areia.",
    "description": "Rammus é extremamente eficiente contra composições físicas, com bom engage e tankiness; bom para iniciar ou contra ADCs pesados.",
    "forte_contra": [
      "Tryndamere",
      "Jax",
      "Irelia"
    ],
    "fraco_contra": [
      "Vayne",
      "Kai’Sa",
      "Lucian"
    ],
    "sinergia_com": [
      "Sejuani",
      "Alistar",
      "Leona"
    ]
  },
  {
    "name": "Rek'Sai",
    "role": "JUNGLE, FIGHTER, ASSASSIN",
    "class": "Lutador, Assassino",
    "lore": "Rek’Sai é uma criatura feroz do Vazio que se move underground, surpreendendo inimigos com emboscadas selvagens.",
    "description": "Rek’Sai é muito perigosa nas invasões e controle do mapa, com boa mobilidade e dano explosivo.",
    "forte_contra": [
      "Master Yi",
      "Draven",
      "Miss Fortune"
    ],
    "fraco_contra": [
      "Nidalee",
      "Rengar",
      "Olaf"
    ],
    "sinergia_com": [
      "Elise",
      "Lee Sin",
      "Nunu"
    ]
  },
  {
    "name": "Rell",
    "role": "SUPPORT, TANK",
    "class": "Tanque, Suporte",
    "lore": "Rell é a Dama de Ferro de Noxus, manipulando metal para subjugar e proteger.",
    "description": "Rell tem ótimo engage e peel, com muito controle de grupo e iniciação poderosa.",
    "forte_contra": [
      "Leona",
      "Nautilus",
      "Thresh"
    ],
    "fraco_contra": [
      "Janna",
      "Lulu",
      "Nami"
    ],
    "sinergia_com": [
      "Kai’Sa",
      "Samira",
      "Miss Fortune"
    ]
  },
  {
    "name": "Renata Glasc",
    "role": "SUPPORT, MAGE",
    "class": "Mago, Suporte",
    "lore": "Renata Glasc é uma baronesa química de Zaun, manipulando aliados e inimigos com sua influência e tecnologia.",
    "description": "Renata oferece utilidade única, salvando aliados e virando lutas com sua ultimate de controle em área.",
    "forte_contra": [
      "Blitzcrank",
      "Leona",
      "Rell"
    ],
    "fraco_contra": [
      "Brand",
      "Zyra",
      "Vel’Koz"
    ],
    "sinergia_com": [
      "Jinx",
      "Aphelios",
      "Kog’Maw"
    ]
  },
  {
    "name": "Renekton",
    "role": "TOP, FIGHTER",
    "class": "Lutador",
    "lore": "Renekton é o Carniceiro de Nasus, um guerreiro impiedoso consumido pela sede de combate e honra quebrada.",
    "description": "Renekton é explosivo, domina o early/mid game, ótimo em rotas solo, mas pode sofrer se atrasar no jogo.",
    "forte_contra": [
      "Darius",
      "Fiora",
      "Camille"
    ],
    "fraco_contra": [
      "Ornn",
      "Malphite",
      "Nasus"
    ],
    "sinergia_com": [
      "Maokai",
      "Leona",
      "Nautilus"
    ]
  },
  {
    "name": "Rengar",
    "role": "JUNGLE, ASSASSIN",
    "class": "Assassino",
    "lore": "Rengar é o terror da caçada, um predador voraz que busca presa digna, juntando troféus de suas caçadas.",
    "description": "Rengar tem burst muito alto, principalmente com ferocidade para pular, surpreender e eliminar alvos frágeis.",
    "forte_contra": [
      "Ezreal",
      "Kai’Sa",
      "Jinx"
    ],
    "fraco_contra": [
      "Thresh",
      "Leona",
      "Nami"
    ],
    "sinergia_com": [
      "Elise",
      "Nunu",
      "Kindred"
    ]
  },
  {
    "name": "Riven",
    "role": "TOP, FIGHTER, ASSASSIN",
    "class": "Lutador, Assassino",
    "lore": "Riven é uma ex-soldado de Noxus buscando redenção através da lâmina quebrada que carrega.",
    "description": "Riven exige mecânicas altas, dominância em duelos e bom controle de wave, podendo se tornar muito forte se ganhar vantagem cedo.",
    "forte_contra": [
      "Darius",
      "Fiora",
      "Jax"
    ],
    "fraco_contra": [
      "Teemo",
      "Malphite",
      "Sett"
    ],
    "sinergia_com": [
      "Leona",
      "Yuumi",
      "Lulu"
    ]
  },
  {
    "name": "Rumble",
    "role": "TOP, MID",
    "class": "Mago, Lutador",
    "lore": "Rumble é um yordle inventor que usa seu mecha improvisado para provar sua força.",
    "description": "Rumble é forte em lutas em área, com ultimate devastador em zonas de combate.",
    "forte_contra": [
      "Shen",
      "Maokai",
      "Malphite"
    ],
    "fraco_contra": [
      "Jayce",
      "Teemo",
      "Viktor"
    ],
    "sinergia_com": [
      "Jarvan IV",
      "Amumu",
      "Orianna"
    ]
  },
  {
    "name": "Ryze",
    "role": "MID, TOP",
    "class": "Mago",
    "lore": "Ryze é um dos magos mais poderosos de Runeterra, carregando pergaminhos de magia ancestral para salvar o mundo da ruína.",
    "description": "Ryze tem alto dano de escala, controle de mapa com ultimate e ótima capacidade de split push.",
    "forte_contra": [
      "Kassadin",
      "Viktor",
      "Orianna"
    ],
    "fraco_contra": [
      "LeBlanc",
      "Fizz",
      "Sylas"
    ],
    "sinergia_com": [
      "Sejuani",
      "Jarvan IV",
      "Hecarim"
    ]
  },
  {
    "name": "Samira",
    "role": "ADC, FIGHTER",
    "class": "Atirador, Lutador",
    "lore": "Samira é uma ousada duelista de Noxus que adora risco, fogo e estilo em combate.",
    "description": "Samira escala com eliminações e dano explosivo, ótima para snowball e lutas prolongadas se posicionada bem.",
    "forte_contra": [
      "Draven",
      "Miss Fortune",
      "Sivir"
    ],
    "fraco_contra": [
      "Caitlyn",
      "Senna",
      "Ziggs"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Rell"
    ]
  },
  {
    "name": "Sejuani",
    "role": "JUNGLE, TANK",
    "class": "Tanque, Controlador",
    "lore": "Sejuani é a baronesa gelada de Freljord, liderando seu povo com disciplina e força crua.",
    "description": "Sejuani traz controle de grupo e resistência fortes, ideal para iniciar e segurar composições adversárias.",
    "forte_contra": [
      "Tristana",
      "Vayne",
      "Jinx"
    ],
    "fraco_contra": [
      "Kayn",
      "Trundle",
      "Elise"
    ],
    "sinergia_com": [
      "Ornn",
      "Nunu",
      "Thresh"
    ]
  },
  {
    "name": "Senna",
    "role": "SUPPORT, ADC",
    "class": "Atirador, Suporte",
    "lore": "Senna foi libertada das sombras e agora caminha entre os vivos como luz e guia contra a escuridão.",
    "description": "Senna é suporte com alcance e dano decente, capaz de limpar ondas e participar em lutas à distância.",
    "forte_contra": [
      "Leona",
      "Blitzcrank",
      "Thresh"
    ],
    "fraco_contra": [
      "Pyke",
      "Nami",
      "Sona"
    ],
    "sinergia_com": [
      "Lucian",
      "Miss Fortune",
      "Nami"
    ]
  },
  {
    "name": "Seraphine",
    "role": "MID, SUPPORT",
    "class": "Mago, Suporte",
    "lore": "Seraphine é uma artista que canaliza emoções por música, conectando pessoas com harmonia e poder.",
    "description": "Seraphine oferece cura, controle de grupo e dano mágico em área bom para composições em time.",
    "forte_contra": [
      "Xayah",
      "Kai’Sa",
      "Ezreal"
    ],
    "fraco_contra": [
      "Zed",
      "Kassadin",
      "Galio"
    ],
    "sinergia_com": [
      "Yuumi",
      "Leona",
      "Orianna"
    ]
  },
  {
    "name": "Sett",
    "role": "TOP, FIGHTER, TANK",
    "class": "Lutador, Tanque",
    "lore": "Sett é o rei das lutas de Punhos de Ferro, um meio-noxiano meio-porquino que comanda ringues e gangues.",
    "description": "Sett combina alta durabilidade com dano corpo a corpo forte e pode se destacar em embates diretos.",
    "forte_contra": [
      "Irelia",
      "Camille",
      "Jax"
    ],
    "fraco_contra": [
      "Malphite",
      "Ornn",
      "Vayne"
    ],
    "sinergia_com": [
      "Leona",
      "Thresh",
      "Nautilus"
    ]
  },
  {
    "name": "Shaco",
    "role": "JUNGLE, ASSASSIN",
    "class": "Assassino, Enganador",
    "lore": "Shaco é um trapaceiro sombrio e caótico que manipula ilusões, sangue e risos macabros.",
    "description": "Shaco é excelente em emboscadas, split-push e manipulação psicológica, mas frágil em lutas diretas.",
    "forte_contra": [
      "Caitlyn",
      "Jinx",
      "Ashe"
    ],
    "fraco_contra": [
      "Lee Sin",
      "Kindred",
      "Karthus"
    ],
    "sinergia_com": [
      "Thresh",
      "Yuumi",
      "Nami"
    ]
  },
  {
    "name": "Shen",
    "role": "TOP, TANK, SUPPORT",
    "class": "Tanque, Suporte",
    "lore": "Shen é o olho da sombra, comandante dos guardiões espirituais que vigiam o equilíbrio entre ordem e caos.",
    "description": "Shen oferece proteção global com ultimate e presença forte na rota top; bom para proteger aliados.",
    "forte_contra": [
      "Fiora",
      "Jax",
      "Camille"
    ],
    "fraco_contra": [
      "Vayne",
      "Camille",
      "Riven"
    ],
    "sinergia_com": [
      "Yuumi",
      "Leona",
      "Thresh"
    ]
  },
  {
    "name": "Shyvana",
    "role": "JUNGLE, FIGHTER",
    "class": "Lutador, Dragão",
    "lore": "Shyvana é uma meio-dragão que busca honra em batalha e destruição para seus inimigos.",
    "description": "Shyvana escala forte, causa dano em área e pode ser versátil entre ser tanque ou dps.",
    "forte_contra": [
      "Amumu",
      "Sejuani",
      "Maokai"
    ],
    "fraco_contra": [
      "Lee Sin",
      "Kindred",
      "Elise"
    ],
    "sinergia_com": [
      "Rammus",
      "Ornn",
      "Thresh"
    ]
  },
  {
    "name": "Singed",
    "role": "TOP",
    "class": "Lutador, Tanque",
    "lore": "Singed é um alquimista louco que deixa rastro tóxico e causa caos nos bastidores da guerra.",
    "description": "Singed tem alta presença de zona e é bom em atrair e perturbar, ótimo para jogar de forma caótica.",
    "forte_contra": [
      "Tryndamere",
      "Yasuo",
      "Vayne"
    ],
    "fraco_contra": [
      "Teemo",
      "Quinn",
      "Rengar"
    ],
    "sinergia_com": [
      "Maokai",
      "Ornn",
      "Rammus"
    ]
  },
  {
    "name": "Sion",
    "role": "TOP, TANK",
    "class": "Tanque",
    "lore": "Sion é um colosso morto-vivo reativado, uma máquina de destruição com sede de guerra eterna.",
    "description": "Sion oferece muito tank, engage e presença em lutas de equipe, sendo difícil de ignorar.",
    "forte_contra": [
      "Tryndamere",
      "Jax",
      "Camille"
    ],
    "fraco_contra": [
      "Vayne",
      "Camille",
      "Quinn"
    ],
    "sinergia_com": [
      "Leona",
      "Thresh",
      "Alistar"
    ]
  },
  {
    "name": "Sivir",
    "role": "ADC",
    "class": "Atirador",
    "lore": "Sivir é uma mercenária habilidosa que guia seu povo com lâmina e boomerangue de prata.",
    "description": "Sivir tem ótimo clear de wave, mobilidade e dano em área com ultimate — bom para composições de poke.",
    "forte_contra": [
      "Ezreal",
      "Kai’Sa",
      "Jinx"
    ],
    "fraco_contra": [
      "Caitlyn",
      "Draven",
      "Ziggs"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Thresh"
    ]
  },
  {
    "name": "Skarner",
    "role": "JUNGLE, FIGHTER, TANK",
    "class": "Tanque, Lutador",
    "lore": "Skarner é um cristaliano ancestral que defende seu território com ferocidade e proteção coletiva.",
    "description": "Skarner traz controle de objetivo, engage firme e utilidade em capturar inimigos isolados.",
    "forte_contra": [
      "Draven",
      "Caitlyn",
      "Jinx"
    ],
    "fraco_contra": [
      "Elise",
      "Kayn",
      "Kindred"
    ],
    "sinergia_com": [
      "Ornn",
      "Thresh",
      "Leona"
    ]
  },
  {
    "name": "Smolder",
    "role": "ADC, MARKSMAN",
    "class": "Atirador",
    "lore": "Smolder é um pequeno dragão, aprendiz da própria Shyvana, que luta para provar seu valor enquanto controla chamas devastadoras.",
    "description": "Smolder é um ADC de scaling, com forte poke em área e alto potencial de dano em lutas prolongadas.",
    "forte_contra": [
      "Kai'Sa",
      "Ezreal",
      "Aphelios"
    ],
    "fraco_contra": [
      "Draven",
      "Caitlyn",
      "Jhin"
    ],
    "sinergia_com": [
      "Lulu",
      "Nami",
      "Thresh"
    ]
  },
  {
    "name": "Sona",
    "role": "SUPPORT, MID",
    "class": "Mago, Suporte",
    "lore": "Sona é uma musicista etérea que toca com cordas mágicas, curando aliados e ferindo inimigos em sinfonia.",
    "description": "Sona oferece cura, escudo e dano em área contínuo — frágil individualmente, mas forte em equipe.",
    "forte_contra": [
      "Leona",
      "Blitzcrank",
      "Thresh"
    ],
    "fraco_contra": [
      "Brand",
      "Zyra",
      "Pyke"
    ],
    "sinergia_com": [
      "Ezreal",
      "Vayne",
      "Kai’Sa"
    ]
  },
  {
    "name": "Soraka",
    "role": "SUPPORT, MID",
    "class": "Suporte, Mago",
    "lore": "Soraka é uma celestial que renunciou ao céu para trazer cura e purificação ao mundo mortal.",
    "description": "Soraka é um suporte de cura pura, muito forte quando o time depende de sustain, mas vulnerável a engage.",
    "forte_contra": [
      "Leona",
      "Blitzcrank",
      "Thresh"
    ],
    "fraco_contra": [
      "LeBlanc",
      "Zed",
      "Pyke"
    ],
    "sinergia_com": [
      "Vayne",
      "Kog’Maw",
      "Ezreal"
    ]
  },
  {
    "name": "Swain",
    "role": "MID, SUPPORT, TANK",
    "class": "Mago, Controlador",
    "lore": "Swain é um estrategista de Noxus que canaliza visões demoníacas para punir inimigos e guiar aliados.",
    "description": "Swain é forte em lutas prolongadas e controle de zona; escala bem em composições com sustento.",
    "forte_contra": [
      "Yuumi",
      "Seraphine",
      "Janna"
    ],
    "fraco_contra": [
      "Fizz",
      "Katarina",
      "Zed"
    ],
    "sinergia_com": [
      "LeBlanc",
      "Galio",
      "Thresh"
    ]
  },
  {
    "name": "Sylas",
    "role": "MID, FIGHTER, ASSASSIN",
    "class": "Mago, Lutador",
    "lore": "Sylas é um mago rebelde que rouba magias e lidera revoluções contra tiranos.",
    "description": "Sylas pode usar ultimates inimigas, é versátil e perigoso em lutas prolongadas.",
    "forte_contra": [
      "Zed",
      "Kassadin",
      "Talon"
    ],
    "fraco_contra": [
      "Galio",
      "Morgana",
      "Fiora"
    ],
    "sinergia_com": [
      "Leona",
      "Thresh",
      "Orianna"
    ]
  },
  {
    "name": "Syndra",
    "role": "MID",
    "class": "Mago",
    "lore": "Syndra é uma maga impetuosa cujos poderes psíquicos cresceram de forma incontrolável.",
    "description": "Syndra causa dano explosivo com seus poderes de esfera — ótimo para eliminar alvos frágeis.",
    "forte_contra": [
      "LeBlanc",
      "Zed",
      "Yasuo"
    ],
    "fraco_contra": [
      "Kassadin",
      "Galio",
      "Morgana"
    ],
    "sinergia_com": [
      "Orianna",
      "Galio",
      "Leona"
    ]
  },
  {
    "name": "Tahm Kench",
    "role": "SUPPORT, TOP",
    "class": "Tanque, Suporte",
    "lore": "Tahm Kench é um devorador das águas que barganha com a alma dos que acha interessantes.",
    "description": "Tahm Kench pode salvar aliados engolindo-os e tem alta resistência — excelente contra picks agressivos.",
    "forte_contra": [
      "Pyke",
      "Thresh",
      "Leona"
    ],
    "fraco_contra": [
      "Blitzcrank",
      "Nautilus",
      "Alistar"
    ],
    "sinergia_com": [
      "Caitlyn",
      "Jinx",
      "Ezreal"
    ]
  },
  {
    "name": "Taliyah",
    "role": "MID, JUNGLE",
    "class": "Mago, Controlador",
    "lore": "Taliyah é uma maga da pedra que molda o terreno ao seu redor, controlando o mapa e movimentando forças.",
    "description": "Taliyah é ótima em mobilidade e controle de rotas; seu ultimate movimenta aliados a locais estratégicos.",
    "forte_contra": [
      "Ziggs",
      "Syndra",
      "Orianna"
    ],
    "fraco_contra": [
      "Zed",
      "Kassadin",
      "Yasuo"
    ],
    "sinergia_com": [
      "Galio",
      "Jarvan IV",
      "Thresh"
    ]
  },
  {
    "name": "Talon",
    "role": "MID, ASSASSIN",
    "class": "Assassino",
    "lore": "Talon é um lâmina afiada de Noxus que elimina dissidentes com precisão e discrição.",
    "description": "Talon é excelente para eliminar alvos frágeis rapidamente e rotacionar pelo mapa.",
    "forte_contra": [
      "Lux",
      "Syndra",
      "Orianna"
    ],
    "fraco_contra": [
      "Zed",
      "Kassadin",
      "Galio"
    ],
    "sinergia_com": [
      "LeBlanc",
      "Nocturne",
      "Thresh"
    ]
  },
  {
    "name": "Taric",
    "role": "SUPPORT, TANK",
    "class": "Tanque, Suporte",
    "lore": "Taric é o guardião da joia celestial, exalando beleza, proteção e luz para os que confiam nele.",
    "description": "Taric oferece cura, escudo e invulnerabilidade a aliados — ótimo em comps defensivas.",
    "forte_contra": [
      "Leona",
      "Blitzcrank",
      "Thresh"
    ],
    "fraco_contra": [
      "Pyke",
      "Nami",
      "Soraka"
    ],
    "sinergia_com": [
      "Jinx",
      "Ezreal",
      "Kai’Sa"
    ]
  },
  {
    "name": "Teemo",
    "role": "TOP, MID, ADC, SUPP (dependendo do modo)",
    "class": "Atirador, Lutador, Escapista",
    "lore": "Teemo é um explorador yordle que espreita nas sombras com armadilhas e veneno.",
    "description": "Teemo domina rotas com invisibilidade e armadilhas, excelente em hostilidade e desgaste.",
    "forte_contra": [
      "Yasuo",
      "Fiora",
      "Tryndamere"
    ],
    "fraco_contra": [
      "Quinn",
      "Vayne",
      "Riven"
    ],
    "sinergia_com": [
      "Nami",
      "Yuumi",
      "Thresh"
    ]
  },
  {
    "name": "Thresh",
    "role": "SUPPORT, TANK",
    "class": "Tanque, Suporte",
    "lore": "Thresh é o carrasco das sombras, aprisionando almas e torturando espíritos dos condenados.",
    "description": "Thresh é um dos melhores suportes utilitários com lantern, ganchos e controle pesado.",
    "forte_contra": [
      "Leona",
      "Nautilus",
      "Blitzcrank"
    ],
    "fraco_contra": [
      "Morgana",
      "Janna",
      "Soraka"
    ],
    "sinergia_com": [
      "Lucian",
      "Vayne",
      "Ezreal"
    ]
  },
  {
    "name": "Tristana",
    "role": "ADC",
    "class": "Atirador",
    "lore": "Tristana é uma Yordle audaciosa que busca emoção em cada explosão de sua arma gigantesca.",
    "description": "Tristana escala fortemente no late, tem alcance crescente e grande mobilidade com salto.",
    "forte_contra": [
      "Jinx",
      "Kai’Sa",
      "Sivir"
    ],
    "fraco_contra": [
      "Caitlyn",
      "Draven",
      "Ziggs"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Thresh"
    ]
  },
  {
    "name": "Trundle",
    "role": "TOP, JUNGLE, FIGHTER, TANK",
    "class": "Lutador, Tanque",
    "lore": "Trundle é um troll campeão que rouba força dos inimigos com sua magia do gelo e domínio da cratera.",
    "description": "Trundle é forte contra tanques – rouba vida, força, resiste e pode sustentar em lutas prolongadas.",
    "forte_contra": [
      "Malphite",
      "Ornn",
      "Sion"
    ],
    "fraco_contra": [
      "Vayne",
      "Kaisa",
      "Kai’Sa"
    ],
    "sinergia_com": [
      "Maokai",
      "Rammus",
      "Thresh"
    ]
  },
  {
    "name": "Tryndamere",
    "role": "TOP, FIGHTER, ASSASSIN",
    "class": "Lutador",
    "lore": "Tryndamere é um guerreiro irascível que busca poder e justiça por sua própria lâmina e fúria.",
    "description": "Tryndamere escala com crítico e sustain; pode ignorar controles com ultimate se bem usado.",
    "forte_contra": [
      "Fiora",
      "Camille",
      "Illaoi"
    ],
    "fraco_contra": [
      "Malphite",
      "Ornn",
      "Sett"
    ],
    "sinergia_com": [
      "Leona",
      "Thresh",
      "Nautilus"
    ]
  },
  {
    "name": "Twisted Fate",
    "role": "MID, SUPPORT",
    "class": "Mago, Controlador",
    "lore": "Twisted Fate é um trapaceiro arcano que manipula cartas para criar vantagem e explorar o destino dos outros.",
    "description": "Twisted Fate tem roam global com sua ultimate e bom controle de ritmo de jogo com cartas.",
    "forte_contra": [
      "Ryze",
      "Syndra",
      "Orianna"
    ],
    "fraco_contra": [
      "Zed",
      "Kassadin",
      "LeBlanc"
    ],
    "sinergia_com": [
      "Thresh",
      "Morgana",
      "Galio"
    ]
  },
  {
    "name": "Twitch",
    "role": "ADC, ASSASSIN",
    "class": "Atirador, Assassino",
    "lore": "Twitch é um rato de esgoto mutante movido por veneno, morto-vivo e sorrateiro.",
    "description": "Twitch é mortal em invisibilidade e lutas longas; ótimo para flanquear e eliminar alvos atrasados.",
    "forte_contra": [
      "Caitlyn",
      "Jinx",
      "Sivir"
    ],
    "fraco_contra": [
      "Caitlyn",
      "Lucian",
      "Vayne"
    ],
    "sinergia_com": [
      "Thresh",
      "Leona",
      "Nami"
    ]
  },
  {
    "name": "Udyr",
    "role": "JUNGLE, FIGHTER, TANK",
    "class": "Lutador, Tanque",
    "lore": "Udyr é um xamã feral que canaliza espíritos animais para lutar com ferocidade primal.",
    "description": "Udyr é forte no early, pressiona rotas e domina objetivos com versatilidade nos estilos de luta.",
    "forte_contra": [
      "Gragas",
      "Amumu",
      "Sejuani"
    ],
    "fraco_contra": [
      "Kindred",
      "Elise",
      "Kayn"
    ],
    "sinergia_com": [
      "Ornn",
      "Thresh",
      "Nunu"
    ]
  },
  {
    "name": "Urgot",
    "role": "TOP, FIGHTER, TANK",
    "class": "Lutador, Tanque",
    "lore": "Urgot é um colosso mecânico que sacrifica partes do próprio corpo para esmagar inimigos.",
    "description": "Urgot causa dano brutal em duelos e tem utilidade com zona e lentidão embutida.",
    "forte_contra": [
      "Fiora",
      "Camille",
      "Irelia"
    ],
    "fraco_contra": [
      "Vayne",
      "Quinn",
      "Camille"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Thresh"
    ]
  },
  {
    "name": "Varus",
    "role": "ADC, MID",
    "class": "Atirador, Mago",
    "lore": "Varus é o portador da mágoa — um ser impiedoso fundido a flechas demoníacas que busca vingança.",
    "description": "Varus tem poke forte, controle de zona e potencial de dano misto; bom em comps mágicas.",
    "forte_contra": [
      "Ezreal",
      "Kai’Sa",
      "Sivir"
    ],
    "fraco_contra": [
      "Caitlyn",
      "Draven",
      "Lucian"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Thresh"
    ]
  },
  {
    "name": "Vayne",
    "role": "ADC",
    "class": "Atirador",
    "lore": "Vayne é uma caçadora de demônios implacável, dedicando sua vida a eliminar o mal.",
    "description": "Vayne escala fortemente, excelente contra tanques com dano verdadeiro e mobilidade.",
    "forte_contra": [
      "Ornn",
      "Malphite",
      "Darius"
    ],
    "fraco_contra": [
      "Draven",
      "Caitlyn",
      "Leona"
    ],
    "sinergia_com": [
      "Leona",
      "Nautilus",
      "Thresh"
    ]
  },
  {
    "name": "Veigar",
    "role": "MID",
    "class": "Mago",
    "lore": "Veigar é um mago malévolo que busca o poder máximo através de energia sombria e manipulação arcana.",
    "description": "Veigar escala infinitamente com stacks e pode abater alvos frágeis com seu burst pesado.",
    "forte_contra": [
      "Lux",
      "Syndra",
      "Orianna"
    ],
    "fraco_contra": [
      "Kassadin",
      "Zed",
      "Galio"
    ],
    "sinergia_com": [
      "Orianna",
      "Galio",
      "Leona"
    ]
  },
  {
    "name": "Vel'Koz",
    "role": "MID, SUPPORT",
    "class": "Mago",
    "lore": "Vel’Koz é uma entidade do Vazio que estuda e disseca tudo ao seu redor, absorvendo conhecimento com ódio meticuloso.",
    "description": "Vel’Koz é dano puro em área com foco em explodir inimigos junto com controle e penetração.",
    "forte_contra": [
      "Lux",
      "Syndra",
      "Orianna"
    ],
    "fraco_contra": [
      "Zed",
      "Fizz",
      "Kassadin"
    ],
    "sinergia_com": [
      "Orianna",
      "Galio",
      "Leona"
    ]
  },
  {
    "name": "Vex",
    "role": "MID, SUPPORT",
    "class": "Mago, Controlador",
    "lore": "Vex é uma yordle melancólica que manipula sombras e desdém para subverter alegria e ordem.",
    "description": "Vex oferece controle, poke e burst; excelente em interromper mobilidade inimiga.",
    "forte_contra": [
      "Yasuo",
      "Zed",
      "Ekko"
    ],
    "fraco_contra": [
      "Galio",
      "Morgana",
      "Tahm Kench"
    ],
    "sinergia_com": [
      "Leona",
      "Thresh",
      "Seraphine"
    ]
  },
  {
    "name": "Vi",
    "role": "JUNGLE, FIGHTER",
    "class": "Lutador",
    "lore": "Vi é uma ex-crimosa de Zaun que agora impõe justiça com seus punhos mecânicos potentes.",
    "description": "Vi é explosiva, com bom engage e dano focalizado; excelente para isolar carrinhos inimigos.",
    "forte_contra": [
      "Lucian",
      "Kai’Sa",
      "Jinx"
    ],
    "fraco_contra": [
      "Elise",
      "Kayn",
      "Gragas"
    ],
    "sinergia_com": [
      "Thresh",
      "Leona",
      "Nunu"
    ]
  },
  {
    "name": "Viego",
    "role": "JUNGLE, MID, FIGHTER, ASSASSIN",
    "class": "Assassino, Mago",
    "lore": "Viego é o Rei Desconhecido que retorna em tormento, possuído por obsessão e dor.",
    "description": "Viego pode possuir inimigos mortos, usar suas habilidades e virar lutas com resets de combate.",
    "forte_contra": [
      "Kai’Sa",
      "Jinx",
      "Ezreal"
    ],
    "fraco_contra": [
      "Thresh",
      "Leona",
      "Nami"
    ],
    "sinergia_com": [
      "Yuumi",
      "Morgana",
      "Seraphine"
    ]
  },
  {
    "name": "Viktor",
    "role": "MID",
    "class": "Mago, Controlador",
    "lore": "Viktor é um tecnomago que busca a evolução através da máquina, mesclando carne e metal.",
    "description": "Viktor causa dano sustentado e poderoso em área, ideal para composições bem coordenadas.",
    "forte_contra": [
      "Zed",
      "Fizz",
      "Yasuo"
    ],
    "fraco_contra": [
      "Kassadin",
      "Galio",
      "Morgana"
    ],
    "sinergia_com": [
      "Orianna",
      "Galio",
      "Leona"
    ]
  },
  {
    "name": "Vladimir",
    "role": "MID, TOP",
    "class": "Mago, Sustentação",
    "lore": "Vladimir é um sanguinárcio que manipula sangue para prolongar vida e castigar inimigos.",
    "description": "Vladimir escala fortemente com cura e poder em lutas longas, mas depende de recursos.",
    "forte_contra": [
      "Malzahar",
      "Swain",
      "Singed"
    ],
    "fraco_contra": [
      "Fiora",
      "Darius",
      "Ornn"
    ],
    "sinergia_com": [
      "Thresh",
      "Leona",
      "Morgana"
    ]
  },
  {
    "name": "Volibear",
    "role": "TOP, JUNGLE, FIGHTER, TANK",
    "class": "Lutador, Tanque",
    "lore": "Volibear é o antigo deus relampejante de Freljord, furioso e indomável como tempestade viva.",
    "description": "Volibear é ótimo para romper linhas e dominar lutas frontais com dano e tankiness.",
    "forte_contra": [
      "Camille",
      "Irelia",
      "Jax"
    ],
    "fraco_contra": [
      "Vayne",
      "Quinn",
      "Sett"
    ],
    "sinergia_com": [
      "Maokai",
      "Rammus",
      "Thresh"
    ]
  },
  {
    "name": "Warwick",
    "role": "JUNGLE, FIGHTER, TANK",
    "class": "Lutador, Tanque",
    "lore": "Warwick é um monstro que caça nas ruas cinzentas de Zaun. Transformado por experimentos agonizantes, seu corpo se fundiu com um sistema de câmaras e bombas, sua veia correndo com fúria alquímica. Ele surge das sombras para punir quem aterroriza as profundezas da cidade. Warwick é atraído pelo sangue e enlouquecido pelo seu cheiro. Nenhum dos que o derramam pode escapar dele.",
    "description": "Warwick é excelente para perseguir alvos enfraquecidos, com sustain alto e bom dano em lutas individuais ou emboscadas.",
    "forte_contra": [
      "Yasuo",
      "Fizz",
      "Tryndamere"
    ],
    "fraco_contra": [
      "Vayne",
      "Quinn",
      "Jinx"
    ],
    "sinergia_com": [
      "Nunu & Willump",
      "Lillia",
      "Sejuani"
    ]
  },
  {
    "name": "Wukong",
    "role": "TOP, FIGHTER",
    "class": "Lutador",
    "lore": "Wukong é um vastaya trapaceiro que usa sua força, agilidade e astúcia para confundir os inimigos. Depois de encontrar um amigo para a vida, o guerreiro Master Yi, Wukong tornou-se o último aluno da antiga arte marcial chamada Wuju. Empunhando um bastão encantado, ele busca impedir que Ionia caia em ruína.",
    "description": "Wukong brilha em duelos, tem bom impacto em teamfights formações de clones, e pode causar bastante confusão em lutas com mobilidade.",
    "forte_contra": [
      "Darius",
      "Fiora",
      "Camille"
    ],
    "fraco_contra": [
      "Malphite",
      "Ornn",
      "Vayne"
    ],
    "sinergia_com": [
      "Master Yi",
      "Yone",
      "Lee Sin"
    ]
  },
  {
    "name": "Xayah",
    "role": "ADC, MARKSMAN",
    "class": "Atirador",
    "lore": "Xayah é uma revolucionária vastaya que luta para salvar seu povo. Ela usa sua velocidade, astúcia e penas cortantes para derrotar quem se opõe a ela, ao lado de seu parceiro Rakan.",
    "description": "Xayah causa dano à distância com controle de zona por meio de suas penas e pode reposicionar com seus feitiços para evitar ser punida.",
    "forte_contra": [
      "Vayne",
      "Sivir",
      "Ezreal"
    ],
    "fraco_contra": [
      "Blitzcrank",
      "Leona",
      "Thresh"
    ],
    "sinergia_com": [
      "Rakan",
      "Leona",
      "Nautilus"
    ]
  },
  {
    "name": "Xerath",
    "role": "MID, MAGE",
    "class": "Mago",
    "lore": "Xerath é a essência da magia arcana concentrada, um executor de poder destrutivo que busca libertar a verdadeira grandeza — embora o preço de tal busca seja a ruína de tudo o que está no seu caminho.",
    "description": "Xerath domina o alcance extremo, poke forte e pressão de rota; porém, é vulnerável à mobilidade inimiga e precisa de posicionamento cuidadoso.",
    "forte_contra": [
      "Vel’Koz",
      "Lux",
      "Orianna"
    ],
    "fraco_contra": [
      "LeBlanc",
      "Fizz",
      "Zed"
    ],
    "sinergia_com": [
      "Orianna",
      "Galio",
      "Thresh"
    ]
  },
  {
    "name": "Xin Zhao",
    "role": "JUNGLE, FIGHTER, ASSASSIN",
    "class": "Lutador, Assassino",
    "lore": "Xin Zhao é o senescal de Demacia, um guerreiro que jurou proteger seu reino com honra e lâmina. Ele enfrenta inimigos com coragem e disciplina, frequentemente liderando a linha de frente.",
    "description": "Xin Zhao tem bom combo de iniciação, excelente para emboscadas, duelos e tem utilidade decente em lutas com vários alvos próximos.",
    "forte_contra": [
      "Kindred",
      "Graves",
      "Viego"
    ],
    "fraco_contra": [
      "Jax",
      "Camille",
      "Ornn"
    ],
    "sinergia_com": [
      "Sejuani",
      "Jarvan IV",
      "Malphite"
    ]
  },
  {
    "name": "Yasuo",
    "role": "MID, FIGHTER, ASSASSIN",
    "class": "Lutador, Assassino",
    "lore": "Yasuo é um espadachim errante marcado por tragédia, que continua sua jornada buscando redenção enquanto aprendizado. Seu domínio da lâmina e vento tornam-no perigoso tanto em duelos quanto em embates em equipe.",
    "description": "Yasuo depende de mecânicas, combos e bons posicionamentos; pode carregar jogos se conseguir vantagem, mas se atrasar sofre bastante contra poke ou controle pesado.",
    "forte_contra": [
      "Zed",
      "Fizz",
      "LeBlanc"
    ],
    "fraco_contra": [
      "Malphite",
      "Ornn",
      "Thresh"
    ],
    "sinergia_com": [
      "Rakan",
      "Yone",
      "Akali"
    ]
  },
  {
    "name": "Yone",
    "role": "MID, FIGHTER, ASSASSIN",
    "class": "Assassino, Lutador",
    "lore": "Yone é o meio-irmão de Yasuo, compartilhando parte do mesmo destino trágico. Ele retorna com poder espiritual grande após sua morte, lutando com duas lâminas enquanto equilibra honra e vingança.",
    "description": "Yone tem alto mobilidade, dano misto, e boas possibilidades de duelismo e peel; porém é frágeis se for pego fora de posição ou antes de escalar.",
    "forte_contra": [
      "Yasuo",
      "Zed",
      "LeBlanc"
    ],
    "fraco_contra": [
      "Galio",
      "Malphite",
      "Fiora"
    ],
    "sinergia_com": [
      "Rakan",
      "Orianna",
      "Thresh"
    ]
  },
  {
    "name": "Yorick",
    "role": "TOP, FIGHTER, TANK",
    "class": "Lutador, Tanque",
    "lore": "Yorick é o guardião das almas, um necromante amaldiçoado que vaga por lugares sombrios carregando o peso de sua própria missão, guiando os mortos com sua pá.",
    "description": "Yorick é excelente em pressionar rotas, split-push e duelar tanky oponentes ou isolar alvos com seus servos mortos-vivos.",
    "forte_contra": [
      "Maokai",
      "Camille",
      "Fiora"
    ],
    "fraco_contra": [
      "Vayne",
      "Quinn",
      "Teemo"
    ],
    "sinergia_com": [
      "Thresh",
      "Nautilus",
      "Leona"
    ]
  },
  {
    "name": "Yunara",
    "role": "TOP, FIGHTER",
    "class": "Lutador, Tank",
    "lore": "Yunara é conhecida como a Fé Inquebrantável, uma guerreira espiritual que canaliza a devoção em poder físico avassalador.",
    "description": "Yunara é resistente, com ferramentas de engage e sustain, sendo ótima na linha de frente.",
    "forte_contra": [
      "Camille",
      "Renekton",
      "Irelia"
    ],
    "fraco_contra": [
      "Vayne",
      "Fiora",
      "Quinn"
    ],
    "sinergia_com": [
      "Sejuani",
      "Galio",
      "Jarvan IV"
    ]
  },
  {
    "name": "Yuumi",
    "role": "SUPPORT, MAGE",
    "class": "Suporte, Mago",
    "lore": "Yuumi é uma gata mágica que busca seu portador, montando-se ao companheiro ideal, atravessando Runeterra enquanto confere auxílio com magia, cura e proteção.",
    "description": "Yuumi oferece grande utilidade em curas, escudos e mobilidade através do parceiro; porém é bem vulnerável quando isolada ou sem suporte de time.",
    "forte_contra": [
      "Leona",
      "Alistar",
      "Blitzcrank"
    ],
    "fraco_contra": [
      "Thresh",
      "Pyke",
      "Nautilus"
    ],
    "sinergia_com": [
      "Kai’Sa",
      "Ezreal",
      "Vayne"
    ]
  },
  {
    "name": "Zac",
    "role": "JUNGLE, TANK",
    "class": "Tanque",
    "lore": "Zac é uma entidade vivenciada pela vida primordial, formado por melaza elasticamente viva, que se sacrifica repetidamente para proteger os outros.",
    "description": "Zac tem iniciação forte, muito controle de grupo, alta durabilidade e boas oportunidades para iniciar lutas de equipe.",
    "forte_contra": [
      "Vayne",
      "Quinn",
      "Tristana"
    ],
    "fraco_contra": [
      "Kayle",
      "Teemo",
      "Draven"
    ],
    "sinergia_com": [
      "Leona",
      "Thresh",
      "Sejuani"
    ]
  },
  {
    "name": "Zed",
    "role": "MID, ASSASSIN",
    "class": "Assassino",
    "lore": "Zed é o mestre das sombras, um guerreiro que abraçou a escuridão como arma. Ele rejeitou os ensinamentos tradicionais para dominar técnicas proibidas de sombras.",
    "description": "Zed é especializado em burst, assassinato de alvos frágeis e mobilidade; bom em snowball mas depende de vantagem inicial.",
    "forte_contra": [
      "Yasuo",
      "LeBlanc",
      "Katarina"
    ],
    "fraco_contra": [
      "Malzahar",
      "Galio",
      "Anivia"
    ],
    "sinergia_com": [
      "Kassadin",
      "Nocturne",
      "Talon"
    ]
  },
  {
    "name": "Zeri",
    "role": "ADC, MARKSMAN",
    "class": "Atirador",
    "lore": "Zeri é uma jovem eletrificada de Zaun cujo poder elétrico corre pelas ruas e pelas comunidades abandonadas, rebelando-se contra a injustiça e criando tempestades com sua energia.",
    "description": "Zeri é móvel, depende de velocidade de ataque e posicionamento; bom em combates de curta distância, constante pressão de poke e esquiva.",
    "forte_contra": [
      "Vayne",
      "Caitlyn",
      "Tristana"
    ],
    "fraco_contra": [
      "Blitzcrank",
      "Thresh",
      "Leona"
    ],
    "sinergia_com": [
      "Yuumi",
      "Nautilus",
      "Leona"
    ]
  },
  {
    "name": "Ziggs",
    "role": "MID, MAGE",
    "class": "Mago",
    "lore": "Ziggs é um yordle explosivo que adora bombas e caos. Ele enche o campo de batalha com explosivos, buscando a explosão maior.",
    "description": "Ziggs tem ótimo poke, limpe de ondas com suas habilidades, alcance e poder de zoneamento; porém é frágil se for pego por engage rápido.",
    "forte_contra": [
      "Lux",
      "Seraphine",
      "Orianna"
    ],
    "fraco_contra": [
      "Zed",
      "Fizz",
      "LeBlanc"
    ],
    "sinergia_com": [
      "Orianna",
      "Galio",
      "Swain"
    ]
  },
  {
    "name": "Zilean",
    "role": "SUPPORT, MAGE",
    "class": "Mago, Suporte",
    "lore": "Zilean é o guardião do tempo, contemplando eras e manipulando fluxos temporais para reparar as falhas do passado enquanto protege o futuro.",
    "description": "Zilean é forte para controle de grupo, ultimates decisivos em teamfights e utilidade de velocidade de habilidades ou atraso de inimigos; entretanto, precisa de proteção e bom posicionamento.",
    "forte_contra": [
      "Assassinos",
      "Burst comps",
      "Dive comps"
    ],
    "fraco_contra": [
      "Displacer-mobility",
      "Interrupts",
      "Long range assassins"
    ],
    "sinergia_com": [
      "Orianna",
      "Galio",
      "Thresh"
    ]
  },
  {
    "name": "Zoe",
    "role": "MID, MAGE",
    "class": "Mago, Controlador",
    "lore": "Zoe é o Aspecto do Crepúsculo, um ser cósmico brincalhão que percebe cada momento como um brinquedo, lançando feitiços e portais que dobram o espaço para sua diversão — e caos.",
    "description": "Zoe tem muito burst, mobilidade por Teleport (via portal), ideal para picks de poke ou emboscadas rápidas, mas frágil se perder vantagem inicial.",
    "forte_contra": [
      "Lux",
      "Syndra",
      "Orianna"
    ],
    "fraco_contra": [
      "Fizz",
      "Zed",
      "Kassadin"
    ],
    "sinergia_com": [
      "Thresh",
      "Galio",
      "Seraphine"
    ]
  },
  {
    "name": "Zyra",
    "role": "SUPPORT, MAGE",
    "class": "Mago, Suporte",
    "lore": "Zyra é um broto do Vazio que personifica as raízes assassinas da natureza, brotando espinhos e manipulando plantas para controlar o campo de batalha.",
    "description": "Zyra domina controle de território com plantas, bom poke e zoneamento; vulnerável a engage direto ou pressão constante.",
    "forte_contra": [
      "Brand",
      "Veigar",
      "Vel’Koz"
    ],
    "fraco_contra": [
      "Thresh",
      "Leona",
      "Blitzcrank"
    ],
    "sinergia_com": [
      "Orianna",
      "Galio",
      "Leona"
    ]
  }
]
